{"contributing":0,"vllm":1,"you":2,"may":3,"find":4,"information":5,"about":6,"docs":7,"ai":8,"https":9,"en":10,"latest":11,"markdownlint":12,"disable":13,"md001":14,"md041":15,"align":16,"center":17,"picture":18,"source":19,"media":20,"prefers":21,"color":22,"scheme":23,"dark":24,"srcset":25,"raw":26,"githubusercontent":27,"com":28,"project":29,"main":30,"assets":31,"logos":32,"logo":33,"text":34,"png":35,"img":36,"alt":37,"src":38,"light":39,"width":40,"55":41,"h3":42,"easy":43,"fast":44,"cheap":45,"llm":46,"serving":47,"everyone":48,"href":49,"documentation":50,"blog":51,"arxiv":52,"org":53,"abs":54,"2309":55,"06180":56,"paper":57,"vllm_project":58,"twitter":59,"discuss":60,"user":61,"forum":62,"slack":63,"developer":64,"news":65,"2025":66,"08":67,"we":68,"hosted":69,"beijing":70,"meetup":71,"mp":72,"weixin":73,"qq":74,"dgkwg1wfpwgo2jcdtqqhxa":75,"focusing":76,"large":77,"scale":78,"deployment":79,"please":80,"slides":81,"here":82,"drive":83,"google":84,"folders":85,"1pid6nsflu43dzri0eatcpgxsazdvbbqf":86,"recording":87,"www":88,"chaspark":89,"live":90,"1166916873711665152":91,"05":92,"nyc":93,"lu":94,"ma":95,"c1rqyf1f":96,"presentation":97,"1_q_aw_iomjwuimf1s1ym":98,"zhjxz8cuel0ijvaquoybea":99,"edit":100,"usp":101,"sharing":102,"now":103,"under":104,"pytorch":105,"foundation":106,"announcement":107,"welcomes":108,"01":109,"excited":110,"announce":111,"alpha":112,"release":113,"v1":114,"major":115,"architectural":116,"upgrade":117,"7x":118,"speedup":119,"clean":120,"code":121,"optimized":122,"execution":123,"loop":124,"zero":125,"overhead":126,"prefix":127,"caching":128,"enhanced":129,"multimodal":130,"support":131,"more":132,"check":133,"out":134,"our":135,"post":136,"27":137,"html":138,"details":139,"summary":140,"previous":141,"04":142,"asia":143,"day":144,"sginnovate":145,"event":146,"limited":147,"availability":148,"morning":149,"evening":150,"slots":151,"remaining":152,"inaugural":153,"from":154,"team":155,"19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo":156,"03":157,"ollama":158,"inference":159,"night":160,"16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u":161,"first":162,"china":163,"n77gibl2coratqhtveazfg":164,"1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq":165,"east":166,"coast":167,"7mu4k4xx":168,"1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs":169,"slide":170,"id":171,"g31441846c39_0_0":172,"02":173,"ninth":174,"h7g3kuj9":175,"meta":176,"1jzc_pzvxrvnsfvcw":177,"v4cfxb6pn7zz2cyp_flwo05aqg":178,"amd":179,"file":180,"1zk5qejiktmlq2eqcxqzlljax3m9s7nwn":181,"view":182,"posted":183,"eighth":184,"zep56hui":185,"cloud":186,"1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4":187,"1h24phewanyrl11xy5dxubvrc9f9kkjix":188,"2024":189,"12":190,"joins":191,"ecosystem":192,"third":193,"robloxandvllmmeetup2024":194,"splashthat":195,"roblox":196,"1a":197,"47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem":198,"second":199,"ygxbpzhl":200,"ibm":201,"12mi2skabnuw5rbwxdyy":202,"hthth4imsnceoq10jdqbxga":203,"2023":204,"10":205,"a16z":206,"1ql":207,"xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s":208,"would":209,"like":210,"express":211,"sincere":212,"gratitude":213,"andreessen":214,"horowitz":215,"30":216,"supporting":217,"open":218,"community":219,"providing":220,"generous":221,"grant":222,"development":223,"research":224,"06":225,"officially":226,"released":227,"fastchat":228,"integration":229,"has":230,"powered":231,"lmsys":232,"vicuna":233,"chatbot":234,"arena":235,"chat":236,"since":237,"mid":238,"april":239,"use":240,"library":241,"originally":242,"developed":243,"sky":244,"computing":245,"lab":246,"cs":247,"berkeley":248,"edu":249,"uc":250,"evolved":251,"driven":252,"contributions":253,"both":254,"academia":255,"industry":256,"state":257,"art":258,"throughput":259,"efficient":260,"management":261,"attention":262,"key":263,"value":264,"memory":265,"pagedattention":266,"20":267,"continuous":268,"batching":269,"incoming":270,"requests":271,"model":272,"cuda":273,"hip":274,"graph":275,"quantizations":276,"gptq":277,"2210":278,"17323":279,"awq":280,"2306":281,"00978":282,"autoround":283,"05516":284,"int4":285,"int8":286,"fp8":287,"kernels":288,"including":289,"flashattention":290,"flashinfer":291,"speculative":292,"decoding":293,"chunked":294,"prefill":295,"flexible":296,"seamless":297,"popular":298,"hugging":299,"face":300,"models":301,"high":302,"various":303,"algorithms":304,"parallel":305,"sampling":306,"beam":307,"search":308,"tensor":309,"pipeline":310,"data":311,"expert":312,"parallelism":313,"distributed":314,"streaming":315,"outputs":316,"openai":317,"compatible":318,"api":319,"server":320,"nvidia":321,"gpus":322,"cpus":323,"intel":324,"powerpc":325,"tpu":326,"aws":327,"neuron":328,"multi":329,"lora":330,"seamlessly":331,"supports":332,"most":333,"huggingface":334,"transformer":335,"llms":336,"llama":337,"mixture":338,"mixtral":339,"deepseek":340,"v2":341,"v3":342,"embedding":343,"e5":344,"mistral":345,"modal":346,"llava":347,"full":348,"list":349,"supported":350,"supported_models":351,"getting":352,"started":353,"install":354,"pip":355,"getting_started":356,"installation":357,"gpu":358,"index":359,"build":360,"wheel":361,"bash":362,"visit":363,"learn":364,"contact":365,"us":366,"start":367,"technical":368,"questions":369,"feature":370,"github":371,"issues":372,"discussing":373,"fellow":374,"users":375,"coordinating":376,"security":377,"disclosures":378,"advisories":379,"collaborations":380,"partnerships":381,"lists":382,"mailto":383,"end":384,"kit":385,"wish":386,"refer":387,"repo":388,"spdx":389,"license":390,"identifier":391,"apache":392,"filecopyrighttext":393,"copyright":394,"contributors":395,"import":396,"ctypes":397,"importlib":398,"util":399,"json":400,"logging":401,"os":402,"re":403,"shutil":404,"subprocess":405,"sys":406,"pathlib":407,"path":408,"which":409,"torch":410,"packaging":411,"version":412,"parse":413,"setuptools":414,"extension":415,"setup":416,"command":417,"build_ext":418,"setuptools_scm":419,"get_version":420,"utils":421,"cpp_extension":422,"cuda_home":423,"rocm_home":424,"def":425,"load_module_from_path":426,"module_name":427,"spec":428,"spec_from_file_location":429,"module":430,"module_from_spec":431,"modules":432,"loader":433,"exec_module":434,"return":435,"root_dir":436,"__file__":437,"parent":438,"logger":439,"getlogger":440,"__name__":441,"cannot":442,"envs":443,"directly":444,"because":445,"depends":446,"installed":447,"yet":448,"join":449,"py":450,"vllm_target_device":451,"platform":452,"startswith":453,"darwin":454,"cpu":455,"warning":456,"automatically":457,"set":458,"due":459,"macos":460,"elif":461,"linux":462,"only":463,"wsl":464,"building":465,"so":466,"able":467,"run":468,"correctly":469,"empty":470,"none":471,"getenv":472,"available":473,"fallback":474,"main_cuda_version":475,"is_sccache_available":476,"bool":477,"sccache":478,"int":479,"vllm_disable_sccache":480,"is_ccache_available":481,"ccache":482,"is_ninja_available":483,"ninja":484,"is_url_available":485,"url":486,"str":487,"urllib":488,"request":489,"urlopen":490,"status":491,"try":492,"except":493,"exception":494,"false":495,"200":496,"class":497,"cmakeextension":498,"__init__":499,"self":500,"name":501,"cmake_lists_dir":502,"kwa":503,"super":504,"sources":505,"py_limited_api":506,"true":507,"abspath":508,"cmake_build_ext":509,"dict":510,"directories":511,"have":512,"been":513,"configured":514,"did_config":515,"determine":516,"number":517,"compilation":518,"jobs":519,"optionally":520,"nvcc":521,"compile":522,"threads":523,"compute_num_jobs":524,"num_jobs":525,"either":526,"max_jobs":527,"environment":528,"variable":529,"defined":530,"info":531,"using":532,"else":533,"sched_getaffinity":534,"isn":535,"universally":536,"fall":537,"back":538,"cpu_count":539,"get":540,"error":541,"len":542,"attributeerror":543,"nvcc_threads":544,"_is_cuda":545,"get_nvcc_cuda_version":546,"11":547,"when":548,"reduce":549,"avoid":550,"overloading":551,"system":552,"max":553,"perform":554,"cmake":555,"configuration":556,"single":557,"configure":558,"ext":559,"ve":560,"already":561,"cmakelists":562,"txt":563,"exit":564,"early":565,"tool":566,"cmake_args":567,"dnvcc_threads":568,"format":569,"build_tool":570,"dcmake_job_pool_compile":571,"string":572,"dcmake_job_pools":573,"default":574,"whatever":575,"picks":576,"make":577,"sure":578,"dcmake_cuda_compiler":579,"bin":580,"check_call":581,"cwd":582,"build_temp":583,"build_extensions":584,"ensure":585,"present":586,"working":587,"check_output":588,"oserror":589,"raise":590,"runtimeerror":591,"executable":592,"create":593,"directory":594,"does":595,"exist":596,"exists":597,"makedirs":598,"targets":599,"target_name":600,"removeprefix":601,"vllm_flash_attn":602,"all":603,"extensions":604,"append":605,"build_args":606,"target":607,"precompiled_build_ext":608,"disables":609,"precompiled":610,"binaries":611,"assert":612,"vllm_use_precompiled":613,"builds":614,"print":615,"skipping":616,"precompiled_wheel_utils":617,"extracts":618,"libraries":619,"other":620,"files":621,"existing":622,"staticmethod":623,"extract_precompiled_and_patch_package":624,"wheel_url_or_path":625,"tempfile":626,"zipfile":627,"temp_dir":628,"isfile":629,"wheel_filename":630,"split":631,"mkdtemp":632,"wheels":633,"wheel_path":634,"downloading":635,"urlretrieve":636,"filename":637,"package_data_patch":638,"files_to_copy":639,"_c":640,"abi3":641,"_moe_c":642,"_flashmla_c":643,"_vllm_fa2_c":644,"_vllm_fa3_c":645,"cumem_allocator":646,"compiled_regex":647,"file_members":648,"filter":649,"lambda":650,"filelist":651,"match":652,"extract":653,"target_path":654,"dirname":655,"exist_ok":656,"wb":657,"dst":658,"copyfileobj":659,"pkg":660,"replace":661,"setdefault":662,"basename":663,"finally":664,"removing":665,"temporary":666,"rmtree":667,"get_base_commit_in_main_branch":668,"force":669,"nightly":670,"mainly":671,"used":672,"ci":673,"testing":674,"vllm_test_use_precompiled_nightly_wheel":675,"commit":676,"hash":677,"upstream":678,"branch":679,"resp_json":680,"curl":681,"repos":682,"commits":683,"decode":684,"utf":685,"upstream_main_commit":686,"loads":687,"sha":688,"docker":689,"context":690,"git":691,"immutable":692,"missing":693,"vllm_docker_build_context":694,"_no_device":695,"has_cuda":696,"_is_neuron":697,"_is_tpu":698,"_is_hip":699,"rocm":700,"_is_cpu":701,"_is_xpu":702,"xpu":703,"_build_custom_ops":704,"get_rocm_version":705,"librocm":706,"core":707,"see":708,"blob":709,"d11f5c20d500f729c393680a01fa902ebf92094b":710,"rocm_version":711,"cpp":712,"l21":713,"librocm_core_file":714,"lib":715,"is_file":716,"librocm_core":717,"cdll":718,"vererrors":719,"c_uint32":720,"get_rocm_core_version":721,"getrocmversion":722,"restype":723,"argtypes":724,"pointer":725,"minor":726,"patch":727,"byref":728,"get_neuronxcc_version":729,"sysconfig":730,"site_dir":731,"get_paths":732,"purelib":733,"version_file":734,"neuronxcc":735,"executed":736,"successfully":737,"fp":738,"content":739,"read":740,"regular":741,"expression":742,"__version__":743,"group":744,"could":745,"output":746,"adapted":747,"apex":748,"8b7a1ff183741dd8f9b87e7bafd04cfde99cea28":749,"nvcc_output":750,"universal_newlines":751,"release_idx":752,"nvcc_cuda_version":753,"get_gaudi_sw_version":754,"returns":755,"driver":756,"enable":757,"console":758,"printing":759,"hl":760,"smi":761,"shell":762,"capture_output":763,"env":764,"enable_console":765,"returncode":766,"stdout":767,"get_vllm_version":768,"write_to":769,"_version":770,"sep":771,"dev":772,"versions":773,"might":774,"contain":775,"cuda_version":776,"cuda_version_str":777,"skip":778,"tarball":779,"required":780,"pypi":781,"sdist":782,"argv":783,"cu":784,"neuron_version":785,"neuron_version_str":786,"unknown":787,"runtime":788,"get_requirements":789,"python":790,"package":791,"dependencies":792,"requirements":793,"requirements_dir":794,"_read_requirements":795,"strip":796,"resolved_requirements":797,"line":798,"common":799,"cuda_major":800,"cuda_minor":801,"modified_requirements":802,"req":803,"flash":804,"attn":805,"built":806,"continue":807,"valueerror":808,"unsupported":809,"ext_modules":810,"_rocm_c":811,"package_data":812,"typed":813,"model_executor":814,"layers":815,"fused_moe":816,"configs":817,"quantization":818,"advance":819,"wheel_location":820,"vllm_precompiled_wheel_location":821,"wheel_url":822,"base_commit":823,"cp38":824,"manylinux1_x86_64":825,"whl":826,"resp":827,"warn":828,"falling":829,"items":830,"extend":831,"cmdclass":832,"glob":833,"requires_files":834,"pyproject":835,"toml":836,"cleaning":837,"lines":838,"readlines":839,"lower":840,"removed":841,"write":842,"done":843,"releasing":844,"releases":845,"offer":846,"reliable":847,"base":848,"packaged":849,"binary":850,"can":851,"conveniently":852,"accessed":853,"via":854,"also":855,"serve":856,"milestones":857,"communicate":858,"newly":859,"features":860,"improvements":861,"upcoming":862,"changes":863,"affect":864,"potential":865,"breaking":866,"versioning":867,"uses":868,"right":869,"shifted":870,"where":871,"new":872,"every":873,"weeks":874,"bug":875,"fixes":876,"opposed":877,"semver":878,"contains":879,"backwards":880,"critical":881,"need":882,"made":883,"special":884,"post1":885,"_major_":886,"milestone":887,"incompatible":888,"similar":889,"_minor_":890,"_patch_":891,"_post1_":892,"_patch":893,"1_":894,"explicit":895,"implicit":896,"cadence":897,"bi":898,"weekly":899,"basis":900,"days":901,"after":902,"same":903,"following":904,"year":905,"future":906,"dates":907,"below":908,"tentative":909,"note":910,"optional":911,"date":912,"jan":913,"feb":914,"mar":915,"apr":916,"jun":917,"jul":918,"13":919,"aug":920,"14":921,"15":922,"16":923,"17":924,"oct":925,"18":926,"19":927,"nov":928,"21":929,"dec":930,"22":931,"23":932,"each":933,"dedicated":934,"current":935,"coverage":936,"llama3":937,"llama4":938,"hardware":939,"h100":940,"mi300x":941,"_note":942,"change":943,"based":944,"availability_":945,"performance":946,"validation":947,"process":948,"step":949,"access":950,"repository":951,"benchmark":952,"workflow":953,"review":954,"familiarize":955,"yourself":956,"configurations":957,"tree":958,"benchmarks":959,"navigate":960,"actions":961,"workflows":962,"yml":963,"v0":964,"rc":965,"results":966,"once":967,"completes":968,"dashboard":969,"hud":970,"reponame":971,"2fvllm":972,"corresponding":973,"comparison":974,"compare":975,"against":976,"verify":977,"regressions":978,"occurred":979,"example":980,"vs":981,"starttime":982,"thu":983,"2c":984,"2017":985,"20apr":986,"202025":987,"2021":988,"3a43":989,"3a50":990,"20gmt":991,"stoptime":992,"wed":993,"2016":994,"20jul":995,"granularity":996,"week":997,"lbranch":998,"lcommit":999,"b6553be1bc75f046b00046a4ad7576364d03c835":1000,"rbranch":1001,"rcommit":1002,"a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f":1003,"benchmarkname":1004,"modelname":1005,"20models":1006,"backendname":1007,"20backends":1008,"modename":1009,"20modes":1010,"dtypename":1011,"20dtype":1012,"devicename":1013,"20devices":1014,"archname":1015,"20platforms":1016,"conduct":1017,"pledge":1018,"members":1019,"leaders":1020,"participation":1021,"harassment":1022,"free":1023,"experience":1024,"regardless":1025,"age":1026,"body":1027,"size":1028,"visible":1029,"invisible":1030,"disability":1031,"ethnicity":1032,"sex":1033,"characteristics":1034,"gender":1035,"identity":1036,"level":1037,"education":1038,"socioeconomic":1039,"nationality":1040,"personal":1041,"appearance":1042,"race":1043,"caste":1044,"religion":1045,"sexual":1046,"orientation":1047,"act":1048,"interact":1049,"ways":1050,"contribute":1051,"welcoming":1052,"diverse":1053,"inclusive":1054,"healthy":1055,"standards":1056,"examples":1057,"behavior":1058,"contributes":1059,"positive":1060,"include":1061,"demonstrating":1062,"empathy":1063,"kindness":1064,"toward":1065,"people":1066,"being":1067,"respectful":1068,"differing":1069,"opinions":1070,"viewpoints":1071,"experiences":1072,"giving":1073,"gracefully":1074,"accepting":1075,"constructive":1076,"feedback":1077,"responsibility":1078,"apologizing":1079,"those":1080,"affected":1081,"mistakes":1082,"learning":1083,"what":1084,"best":1085,"just":1086,"individuals":1087,"overall":1088,"unacceptable":1089,"sexualized":1090,"language":1091,"imagery":1092,"advances":1093,"any":1094,"kind":1095,"trolling":1096,"insulting":1097,"derogatory":1098,"comments":1099,"political":1100,"attacks":1101,"public":1102,"private":1103,"publishing":1104,"others":1105,"physical":1106,"email":1107,"address":1108,"without":1109,"permission":1110,"reasonably":1111,"considered":1112,"inappropriate":1113,"professional":1114,"setting":1115,"enforcement":1116,"responsibilities":1117,"responsible":1118,"clarifying":1119,"enforcing":1120,"acceptable":1121,"take":1122,"appropriate":1123,"fair":1124,"corrective":1125,"action":1126,"response":1127,"deem":1128,"threatening":1129,"offensive":1130,"harmful":1131,"remove":1132,"reject":1133,"wiki":1134,"edits":1135,"aligned":1136,"reasons":1137,"moderation":1138,"decisions":1139,"scope":1140,"applies":1141,"within":1142,"spaces":1143,"individual":1144,"representing":1145,"official":1146,"posting":1147,"social":1148,"account":1149,"acting":1150,"appointed":1151,"representative":1152,"online":1153,"offline":1154,"irl":1155,"instances":1156,"abusive":1157,"harassing":1158,"otherwise":1159,"reported":1160,"channel":1161,"complaints":1162,"reviewed":1163,"investigated":1164,"promptly":1165,"fairly":1166,"obligated":1167,"respect":1168,"privacy":1169,"reporter":1170,"incident":1171,"guidelines":1172,"follow":1173,"impact":1174,"determining":1175,"consequences":1176,"violation":1177,"correction":1178,"deemed":1179,"unprofessional":1180,"unwelcome":1181,"consequence":1182,"written":1183,"clarity":1184,"around":1185,"nature":1186,"explanation":1187,"why":1188,"apology":1189,"requested":1190,"through":1191,"series":1192,"traceback":1193,"typing":1194,"callable":1195,"unittest":1196,"mock":1197,"find_cuda_init":1198,"fn":1199,"object":1200,"helper":1201,"function":1202,"debug":1203,"initialization":1204,"errors":1205,"initializes":1206,"prints":1207,"stack":1208,"trace":1209,"how":1210,"happens":1211,"_lazy_init":1212,"wrapper":1213,"nonlocal":1214,"extract_stack":1215,"initialized":1216,"format_list":1217,"__main__":1218,"import_module":1219,"policy":1220,"reporting":1221,"report":1222,"privately":1223,"vulnerability":1224,"submission":1225,"form":1226,"issue":1227,"triage":1228,"reports":1229,"triaged":1230,"vulnerability_management":1231,"threat":1232,"guide":1233,"usage":1234,"assumptions":1235,"recommendations":1236,"md":1237,"securely":1238,"severity":1239,"risk":1240,"taking":1241,"dealing":1242,"past":1243,"defaults":1244,"cases":1245,"categories":1246,"vulnerabilities":1247,"allow":1248,"remote":1249,"attackers":1250,"execute":1251,"arbitrary":1252,"control":1253,"significantly":1254,"compromise":1255,"confidentiality":1256,"integrity":1257,"interaction":1258,"privileges":1259,"needed":1260,"network":1261,"deserialization":1262,"exploit":1263,"chains":1264,"generally":1265,"rated":1266,"cvss":1267,"serious":1268,"flaws":1269,"elevated":1270,"rce":1271,"specific":1272,"contexts":1273,"significant":1274,"loss":1275,"require":1276,"advanced":1277,"conditions":1278,"some":1279,"trust":1280,"modes":1281,"node":1282,"sort":1283,"privileged":1284,"typically":1285,"scores":1286,"between":1287,"moderate":1288,"cause":1289,"denial":1290,"service":1291,"partial":1292,"disruption":1293,"do":1294,"breach":1295,"rating":1296,"low":1297,"fill":1298,"pr":1299,"description":1300,"ensuring":1301,"checklist":1302,"bottom":1303,"purpose":1304,"test":1305,"plan":1306,"result":1307,"update":1308,"essential":1309,"elements":1310,"effective":1311,"fix":1312,"link":1313,"resolve":1314,"pasting":1315,"before":1316,"e2e":1317,"necessary":1318,"updating":1319,"submitting":1320,"anything":1321,"samplingparams":1322,"creates":1323,"xla":1324,"hlo":1325,"graphs":1326,"length":1327,"buckets":1328,"environ":1329,"neuron_context_length_buckets":1330,"128":1331,"512":1332,"1024":1333,"2048":1334,"token":1335,"gen":1336,"neuron_token_gen_buckets":1337,"quantizes":1338,"weight":1339,"config":1340,"dtype":1341,"neuron_quant_dtype":1342,"s8":1343,"sample":1344,"prompts":1345,"hello":1346,"my":1347,"president":1348,"united":1349,"states":1350,"capital":1351,"france":1352,"params":1353,"sampling_params":1354,"temperature":1355,"top_p":1356,"95":1357,"tinyllama":1358,"1b":1359,"max_num_seqs":1360,"max_model_len":1361,"block_size":1362,"arguments":1363,"sequence":1364,"targeting":1365,"device":1366,"currently":1367,"known":1368,"limitation":1369,"transformers":1370,"neuronx":1371,"todo":1372,"liangfu":1373,"paged":1374,"ruff":1375,"noqa":1376,"e501":1377,"detected":1378,"sdk":1379,"argument":1380,"unspecified":1381,"automated":1382,"detection":1383,"explicitly":1384,"assigned":1385,"neuron_quant":1386,"override_neuron_config":1387,"cast_logits_dtype":1388,"bfloat16":1389,"tensor_parallel_size":1390,"generate":1391,"texts":1392,"requestoutput":1393,"objects":1394,"prompt":1395,"generated":1396,"50":1397,"generated_text":1398,"ngenerated":1399,"saves":1400,"worker":1401,"checkpoint":1402,"enables":1403,"load":1404,"needs":1405,"its":1406,"own":1407,"shard":1408,"rather":1409,"than":1410,"entire":1411,"save_sharded_state":1412,"deepspeedfp":1413,"save":1414,"loaded":1415,"load_format":1416,"sharded_state":1417,"dataclasses":1418,"engineargs":1419,"model_loader":1420,"shardedstateloader":1421,"flexibleargumentparser":1422,"parse_args":1423,"parser":1424,"add_cli_args":1425,"add_argument":1426,"type":1427,"help":1428,"pattern":1429,"default_pattern":1430,"saved":1431,"filenames":1432,"bytes":1433,"safetensors":1434,"args":1435,"engine_args":1436,"from_cli_args":1437,"enable_lora":1438,"saving":1439,"model_path":1440,"is_dir":1441,"must":1442,"local":1443,"instance":1444,"asdict":1445,"prepare":1446,"mkdir":1447,"dump":1448,"engine":1449,"is_v1_engine":1450,"hasattr":1451,"llm_engine":1452,"engine_core":1453,"file_pattern":1454,"max_size":1455,"max_file_size":1456,"copy":1457,"metadata":1458,"listdir":1459,"splitext":1460,"pt":1461,"isdir":1462,"copytree":1463,"offline_inference":1464,"data_parallel":1465,"powermoe":1466,"3b":1467,"dp":1468,"tp":1469,"assume":1470,"ip":1471,"99":1472,"48":1473,"rank":1474,"master":1475,"addr":1476,"port":1477,"13345":1478,"time":1479,"sleep":1480,"get_open_port":1481,"argparse":1482,"argumentparser":1483,"total":1484,"nodes":1485,"enforce":1486,"eager":1487,"store_true":1488,"mode":1489,"num":1490,"seqs":1491,"64":1492,"maximum":1493,"sequences":1494,"processed":1495,"iteration":1496,"tokens":1497,"timeout":1498,"300":1499,"seconds":1500,"unresponsive":1501,"killed":1502,"utilization":1503,"float":1504,"fraction":1505,"allowed":1506,"allocate":1507,"dp_size":1508,"local_dp_rank":1509,"global_dp_rank":1510,"dp_master_ip":1511,"dp_master_port":1512,"gpus_per_dp_rank":1513,"enforce_eager":1514,"trust_remote_code":1515,"gpu_memory_utilization":1516,"vllm_dp_rank":1517,"vllm_dp_rank_local":1518,"vllm_dp_size":1519,"vllm_dp_master_ip":1520,"vllm_dp_master_port":1521,"cuda_visible_devices":1522,"inside":1523,"processes":1524,"100":1525,"should":1526,"different":1527,"usually":1528,"ranks":1529,"dataset":1530,"part":1531,"floor":1532,"remainder":1533,"distribute":1534,"even":1535,"groups":1536,"min":1537,"placeholder":1538,"doing":1539,"max_tokens":1540,"demonstration":1541,"enable_expert_parallel":1542,"enumerate":1543,"break":1544,"give":1545,"engines":1546,"pause":1547,"processing":1548,"loops":1549,"exiting":1550,"tp_size":1551,"node_size":1552,"node_rank":1553,"127":1554,"master_addr":1555,"master_port":1556,"divisible":1557,"dp_per_node":1558,"multiprocessing":1559,"demonstrates":1560,"co":1561,"locate":1562,"training":1563,"actors":1564,"reinforcement":1565,"human":1566,"rlhf":1567,"workloads":1568,"ray":1569,"serves":1570,"framework":1571,"placement":1572,"workers":1573,"bundles":1574,"enabling":1575,"communication":1576,"two":1577,"components":1578,"script":1579,"shows":1580,"variables":1581,"vllm_ray_per_worker_gpus":1582,"vllm_ray_bundle_indices":1583,"land":1584,"desired":1585,"devices":1586,"exchange":1587,"tensors":1588,"means":1589,"inter":1590,"ipc":1591,"sidesteps":1592,"nccl":1593,"limitations":1594,"occur":1595,"multiple":1596,"share":1597,"assumes":1598,"cluster":1599,"four":1600,"clusters":1601,"expects":1602,"exclusive":1603,"during":1604,"profiling":1605,"residual":1606,"activity":1607,"interferes":1608,"causes":1609,"unexpected":1610,"io":1611,"placement_group":1612,"scheduling_strategies":1613,"placementgroupschedulingstrategy":1614,"myllm":1615,"constructor":1616,"sets":1617,"encode":1618,"bundle":1619,"indices":1620,"positional":1621,"forwarded":1622,"bundle_indices":1623,"kwargs":1624,"keyword":1625,"prevent":1626,"manipulating":1627,"top":1628,"pop":1629,"fit":1630,"map":1631,"creating":1632,"raytrainingactor":1633,"actor":1634,"hosts":1635,"facebook":1636,"opt":1637,"125m":1638,"onto":1639,"expose":1640,"handles":1641,"colocated":1642,"automodelforcausallm":1643,"from_pretrained":1644,"parameters":1645,"named_parameters":1646,"zero_":1647,"synchronize":1648,"get_device_uuid":1649,"platforms":1650,"current_platform":1651,"device_uuid":1652,"report_device_id":1653,"get_weight_ipc_handles":1654,"reductions":1655,"reduce_tensor":1656,"hold":1657,"subset":1658,"weights":1659,"gather":1660,"purposes":1661,"owns":1662,"detach":1663,"manages":1664,"init":1665,"pg":1666,"ready":1667,"bundle_specs":1668,"inference_engines":1669,"inference_engine_device_ids":1670,"collective_rpc":1671,"tuple":1672,"training_actor_device_ids":1673,"last":1674,"ipc_handles":1675,"training_actors":1676,"update_weights_from_ipc_handles":1677,"updated":1678,"check_weights_changed":1679,"generation":1680,"comparing":1681,"still":1682,"vllm_use_v1":1683,"mlpspeculator":1684,"gc":1685,"time_generation":1686,"title":1687,"warmup":1688,"sum":1689,"token_ids":1690,"template":1691,"instruction":1692,"describes":1693,"task":1694,"appropriately":1695,"13b":1696,"hf":1697,"speculation":1698,"del":1699,"collect":1700,"speculative_config":1701,"accelerator":1702,"profiler":1703,"cmd":1704,"vllm_torch_profiler_dir":1705,"vllm_profile":1706,"start_profile":1707,"stop_profile":1708,"add":1709,"buffer":1710,"wait":1711,"background":1712,"case":1713,"finish":1714,"writing":1715,"running":1716,"correct":1717,"audio":1718,"namedtuple":1719,"huggingface_hub":1720,"snapshot_download":1721,"autotokenizer":1722,"audioasset":1723,"lorarequest":1724,"audio_assets":1725,"mary_had_lamb":1726,"winning_call":1727,"question_per_audio_count":1728,"recited":1729,"sport":1730,"nursery":1731,"rhyme":1732,"referenced":1733,"modelrequestdata":1734,"prompt_token_ids":1735,"multi_modal_data":1736,"stop_token_ids":1737,"lora_requests":1738,"oom":1739,"unless":1740,"specified":1741,"settings":1742,"tested":1743,"work":1744,"l4":1745,"voxtral":1746,"run_voxtral":1747,"question":1748,"audio_count":1749,"mistral_common":1750,"protocol":1751,"instruct":1752,"messages":1753,"audiochunk":1754,"rawaudio":1755,"textchunk":1756,"usermessage":1757,"chatcompletionrequest":1758,"tokenizers":1759,"mistraltokenizer":1760,"model_name":1761,"mistralai":1762,"mini":1763,"2507":1764,"tokenizer":1765,"from_hf_hub":1766,"8192":1767,"limit_mm_per_prompt":1768,"config_format":1769,"tokenizer_mode":1770,"enable_chunked_prefill":1771,"text_chunk":1772,"audios":1773,"from_file":1774,"get_local_path":1775,"strict":1776,"range":1777,"audio_chunks":1778,"input_audio":1779,"from_audio":1780,"encode_chat_completion":1781,"prompt_ids":1782,"audios_and_sr":1783,"au":1784,"audio_array":1785,"sampling_rate":1786,"gemma3n":1787,"run_gemma3n":1788,"gemma":1789,"3n":1790,"e2b":1791,"max_num_batched_tokens":1792,"start_of_turn":1793,"audio_soft_token":1794,"end_of_turn":1795,"granite":1796,"speech":1797,"run_granite_speech":1798,"somehat":1799,"optimal":1800,"recommended":1801,"readme":1802,"suggested":1803,"8b":1804,"max_lora_rank":1805,"dir":1806,"enabled":1807,"whenever":1808,"pass":1809,"inputs":1810,"speech_lora_path":1811,"audio_placeholder":1812,"start_of_role":1813,"end_of_role":1814,"knowledge":1815,"cutoff":1816,"ntoday":1817,"december":1818,"nyou":1819,"helpful":1820,"assistant":1821,"end_of_text":1822,"minicpm":1823,"run_minicpmo":1824,"openbmb":1825,"2_6":1826,"4096":1827,"stop_tokens":1828,"im_end":1829,"endoftext":1830,"convert_tokens_to_ids":1831,"audio_chat_template":1832,"message":1833,"im_start":1834,"role":1835,"endfor":1836,"add_generation_prompt":1837,"spk_bos":1838,"spk":1839,"spk_eos":1840,"tts_bos":1841,"endif":1842,"apply_chat_template":1843,"tokenize":1844,"chat_template":1845,"phi":1846,"run_phi4mm":1847,"image":1848,"show":1849,"microsoft":1850,"vision":1851,"manually":1852,"specify":1853,"placeholders":1854,"audio_":1855,"12800":1856,"320":1857,"run_phi4_multimodal":1858,"revision":1859,"refs":1860,"70":1861,"qwen2":1862,"run_qwen2_audio":1863,"qwen":1864,"7b":1865,"audio_in_prompt":1866,"idx":1867,"audio_bos":1868,"audio_eos":1869,"omni":1870,"run_qwen2_5_omni":1871,"default_system":1872,"virtual":1873,"alibaba":1874,"capable":1875,"perceiving":1876,"auditory":1877,"visual":1878,"well":1879,"generating":1880,"ultravox":1881,"run_ultravox":1882,"fixie":1883,"v0_5":1884,"3_2":1885,"whisper":1886,"run_whisper":1887,"input":1888,"per":1889,"turbo":1890,"startoftranscript":1891,"448":1892,"model_example_map":1893,"granite_speech":1894,"minicpmo":1895,"phi4_mm":1896,"phi4_multimodal":1897,"qwen2_audio":1898,"qwen2_5_omni":1899,"demo":1900,"choices":1901,"keys":1902,"model_type":1903,"seed":1904,"initializing":1905,"num_audios":1906,"req_data":1907,"modalities":1908,"default_limits":1909,"video":1910,"identical":1911,"batch":1912,"mm_data":1913,"asset":1914,"audio_and_sample_rate":1915,"num_prompts":1916,"applicable":1917,"lora_request":1918,"datasets":1919,"add_dataset_parser":1920,"get_samples":1921,"metrics":1922,"reader":1923,"counter":1924,"vector":1925,"importerror":1926,"get_custom_mm_prompts":1927,"image_urls":1928,"image_url":1929,"method":1930,"eagle":1931,"ngram":1932,"eagle3":1933,"mtp":1934,"lookup":1935,"temp":1936,"256":1937,"custom":1938,"mm":1939,"endpoint_type":1940,"model_dir":1941,"custom_mm_prompts":1942,"requires":1943,"custom_skip_chat_template":1944,"add_special_tokens":1945,"adding":1946,"bos":1947,"twice":1948,"templates":1949,"eagle_dir":1950,"yuhuili":1951,"num_speculative_tokens":1952,"num_spec_tokens":1953,"prompt_lookup_max":1954,"prompt_lookup_min":1955,"disable_log_stats":1956,"16384":1957,"disable_chunked_mm_input":1958,"output_len":1959,"print_output":1960,"get_metrics":1961,"assertionerror":1962,"disaggregated":1963,"prefilling":1964,"launch":1965,"transfer":1966,"kv":1967,"cache":1968,"them":1969,"kvtransferconfig":1970,"run_prefill":1971,"prefill_done":1972,"receives":1973,"while":1974,"three":1975,"receive":1976,"hi":1977,"your":1978,"actually":1979,"tell":1980,"me":1981,"very":1982,"long":1983,"story":1984,"pyncclconnector":1985,"transmit":1986,"caches":1987,"kv_producer":1988,"ktc":1989,"kv_connector":1990,"kv_role":1991,"kv_rank":1992,"kv_parallel_size":1993,"a6000":1994,"40gb":1995,"adjust":1996,"kv_transfer_config":1997,"2000":1998,"finished":1999,"keep":2000,"prematurely":2001,"causing":2002,"incomplete":2003,"keyboardinterrupt":2004,"stopped":2005,"run_decode":2006,"kv_consumer":2007,"producer":2008,"pipe":2009,"waiting":2010,"point":2011,"transferred":2012,"prefill_process":2013,"decode_process":2014,"terminate":2015,"namespace":2016,"pil":2017,"autoprocessor":2018,"fetch_image":2019,"image_data":2020,"load_aria":2021,"rhymes":2022,"aria":2023,"slow":2024,"fim_prefix":2025,"fim_suffix":2026,"93532":2027,"93653":2028,"944":2029,"93421":2030,"1019":2031,"93519":2032,"load_aya_vision":2033,"cohereforai":2034,"aya":2035,"processor":2036,"load_command_a_vision":2037,"coherelabs":2038,"07":2039,"122b":2040,"32768":2041,"load_deepseek_vl2":2042,"vl2":2043,"tiny":2044,"hf_overrides":2045,"architectures":2046,"deepseekvlv2forcausallm":2047,"image_":2048,"load_gemma3":2049,"4b":2050,"load_h2ovl":2051,"h2oai":2052,"h2ovl":2053,"mississippi":2054,"800m":2055,"mm_processor_kwargs":2056,"max_dynamic_patch":2057,"stop":2058,"eos_token_id":2059,"load_hyperclovax_seed_vision":2060,"naver":2061,"hyperclovax":2062,"_image_url":2063,"ocr":2064,"lens_keywords":2065,"lens_local_keywords":2066,"load_idefics3":2067,"huggingfacem4":2068,"idefics3":2069,"confirmed":2070,"l40":2071,"longest_edge":2072,"optimizations":2073,"364":2074,"begin_of_text":2075,"end_of_utterance":2076,"nassistant":2077,"load_interns1":2078,"internlm":2079,"intern":2080,"s1":2081,"img_context":2082,"load_internvl":2083,"opengvlab":2084,"internvl2":2085,"2b":2086,"internvl":2087,"variants":2088,"card":2089,"words":2090,"conversation":2091,"load_llama4":2092,"scout":2093,"17b":2094,"16e":2095,"131072":2096,"load_llava":2097,"caution":2098,"original":2099,"wasn":2100,"really":2101,"trained":2102,"poor":2103,"load_llava_next":2104,"load_llava_onevision":2105,"onevision":2106,"ov":2107,"load_keye_vl":2108,"kwai":2109,"keye":2110,"vl":2111,"preview":2112,"load_kimi_vl":2113,"moonshotai":2114,"kimi":2115,"a3b":2116,"load_mistral3":2117,"small":2118,"24b":2119,"2503":2120,"ignore_patterns":2121,"consolidated":2122,"inst":2123,"load_mllama":2124,"11b":2125,"img_prompt":2126,"given":2127,"load_nvlm_d":2128,"nvlm":2129,"72b":2130,"ovis":2131,"load_ovis":2132,"aidc":2133,"ovis2":2134,"half":2135,"load_pixtral_hf":2136,"pixtral":2137,"12b":2138,"load_phi3v":2139,"num_crops":2140,"override":2141,"kwarg":2142,"frame":2143,"scenarios":2144,"speaking":2145,"larger":2146,"preprocessing":2147,"references":2148,"formula":2149,"transform":2150,"found":2151,"loading":2152,"locally":2153,"processing_phi3_v":2154,"l194":2155,"load_phi4mm":2156,"images":2157,"vision_lora_path":2158,"passed":2159,"calls":2160,"dynamic_hd":2161,"load_phi4_multimodal":2162,"load_qwen_vl_chat":2163,"qwenvlforconditionalgeneration":2164,"attribute":2165,"chatml":2166,"qwen_generation_utils":2167,"l265":2168,"copied":2169,"chat_templating":2170,"load_qwen2_vl":2171,"qwen_vl_utils":2172,"smart_resize":2173,"modulenotfounderror":2174,"resized":2175,"functionality":2176,"post_process_image":2177,"height":2178,"resized_height":2179,"resized_width":2180,"max_pixels":2181,"28":2182,"resize":2183,"load_qwen2_5_vl":2184,"load_smolvlm":2185,"huggingfacetb":2186,"smolvlm2":2187,"max_image_size":2188,"384":2189,"load_step3":2190,"stepfun":2191,"step3":2192,"verified":2193,"8xh100":2194,"85":2195,"reasoning_parser":2196,"begin":2197,"sentence":2198,"bot":2199,"im_patch":2200,"eot":2201,"think":2202,"load_tarsier":2203,"tarsier":2204,"load_tarsier2":2205,"tarsier2":2206,"recap":2207,"tarsier2forconditionalgeneration":2208,"vision_start":2209,"image_pad":2210,"vision_end":2211,"aya_vision":2212,"command_a_vision":2213,"deepseek_vl_v2":2214,"gemma3":2215,"h2ovl_chat":2216,"hyperclovax_seed_vision":2217,"interns1":2218,"internvl_chat":2219,"keye_vl":2220,"kimi_vl":2221,"next":2222,"mistral3":2223,"mllama":2224,"nvlm_d":2225,"phi3_v":2226,"pixtral_hf":2227,"qwen_vl_chat":2228,"qwen2_vl":2229,"qwen2_5_vl":2230,"smolvlm":2231,"run_generate":2232,"run_chat":2233,"num_images":2234,"invalid":2235,"random":2236,"calling":2237,"want":2238,"client":2239,"location":2240,"http":2241,"8000":2242,"completions":2243,"header":2244,"application":2245,"authorization":2246,"bearer":2247,"describe":2248,"detail":2249,"s3":2250,"amazonaws":2251,"cms":2252,"ipressroom":2253,"338":2254,"201808":2255,"5b894ee1a138352221103195_a680":2256,"7ejogging":2257,"a680":2258,"edit_hero":2259,"jpg":2260,"one":2261,"answer":2262,"french":2263,"wolframcloud":2264,"obj":2265,"resourcesystem":2266,"a0e":2267,"a0ee3983":2268,"46c6":2269,"4c92":2270,"b85d":2271,"059044639928":2272,"6af8cfb971db031b":2273,"simple":2274,"switch":2275,"nemo":2276,"2407":2277,"ability":2278,"generate_random_id":2279,"characters":2280,"ascii_letters":2281,"digits":2282,"random_id":2283,"choice":2284,"simulate":2285,"called":2286,"get_current_weather":2287,"city":2288,"unit":2289,"weather":2290,"degrees":2291,"partly":2292,"cloudly":2293,"highs":2294,"90":2295,"tool_functions":2296,"tools":2297,"properties":2298,"san":2299,"francisco":2300,"letter":2301,"abbreviation":2302,"ca":2303,"mean":2304,"california":2305,"fetch":2306,"enum":2307,"celsius":2308,"fahrenheit":2309,"temperate":2310,"dallas":2311,"let":2312,"simulating":2313,"call":2314,"above":2315,"tool_calls":2316,"tool_answers":2317,"tool_call_id":2318,"yields":2319,"tx":2320,"separates":2321,"distinct":2322,"manage":2323,"occupies":2324,"whereas":2325,"performs":2326,"steps":2327,"across":2328,"broadcast":2329,"collective":2330,"rpc":2331,"simply":2332,"production":2333,"implementation":2334,"replicas":2335,"openrlhf":2336,"rlhf_utils":2337,"stateless_init_process_group":2338,"get_ip":2339,"workload":2340,"train_model":2341,"initialize":2342,"placed":2343,"reserves":2344,"pg_inference":2345,"scheduling_inference":2346,"placement_group_capture_child_tasks":2347,"placement_group_bundle_index":2348,"flag":2349,"reduces":2350,"up":2351,"latency":2352,"num_cpus":2353,"num_gpus":2354,"scheduling_strategy":2355,"worker_extension_cls":2356,"workerextension":2357,"distributed_executor_backend":2358,"llmengine":2359,"create_test_prompts":2360,"robot":2361,"injure":2362,"logprobs":2363,"prompt_logprobs":2364,"top_k":2365,"presence_penalty":2366,"meaning":2367,"life":2368,"frequency_penalty":2369,"process_requests":2370,"test_prompts":2371,"continuously":2372,"handle":2373,"request_id":2374,"has_unfinished_requests":2375,"add_request":2376,"request_outputs":2377,"request_output":2378,"initialize_engine":2379,"from_engine_args":2380,"runs":2381,"datetime":2382,"union":2383,"albumentations":2384,"numpy":2385,"np":2386,"rasterio":2387,"regex":2388,"einops":2389,"rearrange":2390,"terratorch":2391,"datamodules":2392,"sen1floods11nongeodatamodule":2393,"set_default_dtype":2394,"float16":2395,"no_data":2396,"9999":2397,"no_data_float":2398,"0001":2399,"offset":2400,"percentile":2401,"datamodule_config":2402,"bands":2403,"blue":2404,"green":2405,"red":2406,"nir_narrow":2407,"swir_1":2408,"swir_2":2409,"batch_size":2410,"constant_scale":2411,"data_root":2412,"dccstor":2413,"geofm":2414,"finetuning":2415,"sen1floods11":2416,"drop_last":2417,"no_data_replace":2418,"no_label_replace":2419,"num_workers":2420,"test_transform":2421,"always_apply":2422,"interpolation":2423,"totensorv2":2424,"transpose_mask":2425,"prithvimae":2426,"skip_tokenizer_init":2427,"input_data":2428,"location_coords":2429,"merge":2430,"structure":2431,"float32":2432,"pixel_values":2433,"use_tqdm":2434,"generate_datamodule":2435,"datamodule":2436,"process_channel_group":2437,"orig_img":2438,"channels":2439,"reference":2440,"shape":2441,"rgb":2442,"num_channels":2443,"valid_mask":2444,"ones_like":2445,"rescale":2446,"enhancing":2447,"contrast":2448,"max_value":2449,"3000":2450,"min_value":2451,"clamp":2452,"zeros":2453,"read_geotiff":2454,"file_path":2455,"ndarray":2456,"coords":2457,"lnglat":2458,"save_geotiff":2459,"output_path":2460,"band":2461,"geotiff":2462,"dest":2463,"_convert_np_uint8":2464,"float_image":2465,"255":2466,"astype":2467,"uint8":2468,"load_example":2469,"file_paths":2470,"std":2471,"paths":2472,"containing":2473,"values":2474,"array":2475,"created":2476,"imgs":2477,"metas":2478,"temporal_coords":2479,"rescaling":2480,"don":2481,"normalize":2482,"nodata":2483,"moveaxis":2484,"julian_day":2485,"strptime":2486,"timetuple":2487,"tm_yday":2488,"timestamp":2489,"axis":2490,"num_frames":2491,"expand_dims":2492,"di":2493,"run_model":2494,"img_size":2495,"lightning_model":2496,"reflect":2497,"pad":2498,"original_h":2499,"original_w":2500,"pad_h":2501,"pad_w":2502,"sliding":2503,"window":2504,"windows":2505,"unfold":2506,"h1":2507,"w1":2508,"batches":2509,"num_batches":2510,"tensor_split":2511,"dim":2512,"unsqueeze":2513,"prithvi":2514,"eo":2515,"300m":2516,"tl":2517,"pred_imgs":2518,"apply":2519,"standardization":2520,"squeeze":2521,"transpose":2522,"no_grad":2523,"pred":2524,"y_hat":2525,"argmax":2526,"nn":2527,"functional":2528,"interpolate":2529,"nearest":2530,"concat":2531,"data_file":2532,"output_dir":2533,"rgb_outputs":2534,"input_indices":2535,"model_obj":2536,"meta_data":2537,"10000":2538,"convert":2539,"bgr":2540,"count":2541,"compress":2542,"lzw":2543,"pred_file":2544,"pred_":2545,"tiff":2546,"rgb_orig":2547,"nan":2548,"img_pred":2549,"isnan":2550,"img_pred_file":2551,"rgb_pred_":2552,"name_suffix":2553,"rgb_file":2554,"original_rgb_":2555,"mae":2556,"add_help":2557,"india_900498_s2hand":2558,"tif":2559,"christian":2560,"pinto":2561,"nargs":2562,"six":2563,"selected":2564,"selects":2565,"s2l1c":2566,"vars":2567,"instantiating":2568,"logits":2569,"basic":2570,"implementing":2571,"dummylogitsprocessor":2572,"test_utils":2573,"dummy":2574,"employed":2575,"target_token":2576,"extra_args":2577,"mask":2578,"constructed":2579,"specifying":2580,"expect":2581,"decoded":2582,"yielding":2583,"shown":2584,"racist":2585,"he":2586,"nhe":2587,"hands":2588,"nthe":2589,"vllmconfig":2590,"logits_processor":2591,"batchupdate":2592,"logitsprocessor":2593,"movedirectionality":2594,"hypothetical":2595,"fake":2596,"logit":2597,"vllm_config":2598,"is_pin_memory":2599,"req_info":2600,"is_argmax_invariant":2601,"never":2602,"impacts":2603,"greedy":2604,"update_state":2605,"batch_update":2606,"added":2607,"moved":2608,"unidirectional":2609,"move":2610,"swap":2611,"adx":2612,"bdx":2613,"direct":2614,"a_val":2615,"b_val":2616,"modification":2617,"rows_list":2618,"cols":2619,"rows":2620,"values_to_keep":2621,"clone":2622,"inf":2623,"utilize":2624,"logitproc":2625,"sampling_params_list":2626,"67":2627,"logits_processors":2628,"60":2629,"credentials":2630,"llama2":2631,"lora_path":2632,"define":2633,"adapters":2634,"max_loras":2635,"expectation":2636,"adapter":2637,"ran":2638,"sql":2639,"query":2640,"table":2641,"schema":2642,"table_name_74":2643,"icao":2644,"varchar":2645,"airport":2646,"lilongwe":2647,"international":2648,"32003":2649,"lora2":2650,"controls":2651,"loras":2652,"numbers":2653,"higher":2654,"slot":2655,"preallocated":2656,"know":2657,"possible":2658,"max_cpu_loras":2659,"repo_id":2660,"yard1":2661,"guided":2662,"structured":2663,"techniques":2664,"grammar":2665,"produce":2666,"formatted":2667,"pydantic":2668,"basemodel":2669,"guideddecodingparams":2670,"options":2671,"guided_decoding_params_choice":2672,"negative":2673,"sampling_params_choice":2674,"guided_decoding":2675,"prompt_choice":2676,"classify":2677,"sentiment":2678,"wonderful":2679,"guided_decoding_params_regex":2680,"sampling_params_regex":2681,"prompt_regex":2682,"alan":2683,"turing":2684,"who":2685,"works":2686,"enigma":2687,"cartype":2688,"sedan":2689,"suv":2690,"truck":2691,"coupe":2692,"cardescription":2693,"brand":2694,"car_type":2695,"json_schema":2696,"model_json_schema":2697,"guided_decoding_params_json":2698,"sampling_params_json":2699,"prompt_json":2700,"iconic":2701,"car":2702,"simplified_sql_grammar":2703,"root":2704,"select_statement":2705,"select":2706,"column":2707,"condition":2708,"col_1":2709,"col_2":2710,"table_1":2711,"table_2":2712,"guided_decoding_params_grammar":2713,"sampling_params_grammar":2714,"prompt_grammar":2715,"username":2716,"format_output":2717,"generate_output":2718,"am":2719,"config_buckets":2720,"initialize_llm":2721,"openlm":2722,"open_llama_7b":2723,"open_llama_3b":2724,"32":2725,"neuronx_distributed_inference":2726,"add_instruct":2727,"textprompt":2728,"get_image":2729,"stream":2730,"recipe":2731,"mayonnaise":2732,"sentences":2733,"italy":2734,"famous":2735,"pexels":2736,"photos":2737,"1108099":2738,"photo":2739,"jpeg":2740,"auto":2741,"tinysrgb":2742,"dpr":2743,"500":2744,"get_vllm_mllama_model_inputs":2745,"single_image":2746,"put":2747,"compose":2748,"input_image":2749,"has_image":2750,"isinstance":2751,"numel":2752,"instruct_prompt":2753,"print_outputs":2754,"got":2755,"sequence_parallel_enabled":2756,"skip_warmup":2757,"save_sharded_checkpoint":2758,"on_device_sampling_config":2759,"global_topk":2760,"dynamic":2761,"deterministic":2762,"batched_inputs":2763,"batched_sample_params":2764,"pmpt":2765,"zip":2766,"qwen3":2767,"reranker":2768,"6b":2769,"difference":2770,"converted":2771,"classification":2772,"yes":2773,"151669":2774,"making":2775,"extremely":2776,"inefficient":2777,"mention":2778,"score":2779,"converting":2780,"proposed":2781,"discussions":2782,"concise":2783,"tomaarsen":2784,"seq":2785,"cls":2786,"runner":2787,"pooling":2788,"follows":2789,"get_llm":2790,"qwen3forsequenceclassification":2791,"classifier_from_token":2792,"is_original_qwen3_reranker":2793,"converts":2794,"better":2795,"firstly":2796,"route":2797,"lm_head":2798,"vectors":2799,"conversion":2800,"logic":2801,"controlled":2802,"query_template":2803,"document_template":2804,"document":2805,"njudge":2806,"whether":2807,"meets":2808,"provided":2809,"suffix":2810,"doc":2811,"web":2812,"retrieve":2813,"relevant":2814,"passages":2815,"queries":2816,"explain":2817,"gravity":2818,"documents":2819,"attracts":2820,"bodies":2821,"towards":2822,"gives":2823,"movement":2824,"planets":2825,"sun":2826,"experimental":2827,"torchrun":2828,"11400":2829,"motivation":2830,"nproc":2831,"torchrun_example":2832,"tests":2833,"test_torchrun_example":2834,"dist":2835,"external_launcher":2836,"important":2837,"pipeline_parallel_size":2838,"get_rank":2839,"further":2840,"tips":2841,"processgroup":2842,"gloo":2843,"backend":2844,"poolingparams":2845,"set_defaults":2846,"jinaai":2847,"jina":2848,"embeddings":2849,"white":2850,"rabbit":2851,"english":2852,"sigue":2853,"al":2854,"conejo":2855,"blanco":2856,"spanish":2857,"suis":2858,"le":2859,"lapin":2860,"blanc":2861,"跟着白兔走":2862,"chinese":2863,"اتبع":2864,"الأرنب":2865,"الأبيض":2866,"arabic":2867,"folge":2868,"dem":2869,"weißen":2870,"kaninchen":2871,"german":2872,"embeddingrequestoutputs":2873,"embed":2874,"pooling_params":2875,"dimensions":2876,"embeds":2877,"embeds_trimmed":2878,"nembeddings":2879,"validates":2880,"previously":2881,"sharded":2882,"modele":2883,"load_sharded_state":2884,"world":2885,"parameter":2886,"nrunning":2887,"completion":2888,"display":2889,"vllm_attention_backend":2890,"dual_chunk_flash_attn":2891,"vllm_allow_long_max_model_len":2892,"load_prompt":2893,"lengths":2894,"qianwen":2895,"res":2896,"oss":2897,"cn":2898,"aliyuncs":2899,"1m":2900,"64k":2901,"200k":2902,"600k":2903,"repetition_penalty":2904,"detokenize":2905,"1048576":2906,"cleanup_dist_env_and_memory":2907,"benchmarking":2908,"benchmark_prefix_caching":2909,"school":2910,"principal":2911,"skilled":2912,"effectively":2913,"managing":2914,"faculty":2915,"staff":2916,"draft":2917,"grade":2918,"head":2919,"teacher":2920,"girls":2921,"independent":2922,"emphasizes":2923,"joyful":2924,"discovery":2925,"candidate":2926,"coming":2927,"round":2928,"panel":2929,"interview":2930,"8th":2931,"math":2932,"teaching":2933,"years":2934,"ed":2935,"middle":2936,"fulfill":2937,"paragraph":2938,"generating_prompts":2939,"baseline":2940,"regular_llm":2941,"enable_prefix_caching":2942,"regular_generated_texts":2943,"destroy":2944,"prefix_cached_llm":2945,"shared":2946,"computed":2947,"cached_generated_texts":2948,"generated_same":2949,"answers":2950,"gauge":2951,"histogram":2952,"metric":2953,"bucket_le":2954,"contextlib":2955,"contextmanager":2956,"imageasset":2957,"videoasset":2958,"convert_image_mode":2959,"run_aria":2960,"modality":2961,"equivalent":2962,"run_aya_vision":2963,"crop_to_patches":2964,"start_of_turn_token":2965,"user_token":2966,"end_of_turn_token":2967,"chatbot_token":2968,"blip":2969,"run_blip2":2970,"inaccurate":2971,"salesforce":2972,"blip2":2973,"64ff02f3f8cf9e4f5b038262":2974,"chameleon":2975,"run_chameleon":2976,"run_command_a_vision":2977,"img_patch":2978,"run_deepseek_vl2":2979,"florence2":2980,"run_florence2":2981,"florence":2982,"isotr0py":2983,"more_detailed_caption":2984,"fuyu":2985,"run_fuyu":2986,"adept":2987,"run_gemma3":2988,"do_pan_and_scan":2989,"start_of_image":2990,"image_soft_token":2991,"glm":2992,"4v":2993,"run_glm4v":2994,"zai":2995,"9b":2996,"glm4vforcausallm":2997,"begin_of_image":2998,"end_of_image":2999,"151329":3000,"151336":3001,"151338":3002,"1v":3003,"run_glm4_1v":3004,"thinking":3005,"shortest_edge":3006,"12544":3007,"47040000":3008,"fps":3009,"begin_of_video":3010,"end_of_video":3011,"gmask":3012,"sop":3013,"run_h2ovl":3014,"run_hyperclovax_seed_vision":3015,"raster":3016,"order":3017,"word":3018,"feels":3019,"unnatural":3020,"reading":3021,"clova":3022,"bigshane":3023,"entity":3024,"names":3025,"iphone":3026,"quads":3027,"92":3028,"run_idefics3":3029,"run_interns1":3030,"run_internvl":3031,"internvl3":3032,"token_id":3033,"run_keye_vl":3034,"video_pad":3035,"run_kimi_vl":3036,"im_user":3037,"im_middle":3038,"media_start":3039,"media_content":3040,"media_pad":3041,"media_end":3042,"im_assistant":3043,"run_llama4":3044,"run_llava":3045,"run_llava_next":3046,"run_llava_next_video":3047,"run_llava_onevision":3048,"mantis":3049,"run_mantis":3050,"llama3_template":3051,"start_header_id":3052,"end_header_id":3053,"eot_id":3054,"tiger":3055,"siglip":3056,"mantisforconditionalgeneration":3057,"128009":3058,"run_minicpmv_base":3059,"audio_language":3060,"doesn":3061,"fork":3062,"pull":3063,"4087":3064,"issuecomment":3065,"2250397630":3066,"hwwwh":3067,"2_5":3068,"o2":3069,"eos_id":3070,"modality_placeholder":3071,"run_minicpmv":3072,"run_mistral3":3073,"run_mllama":3074,"molmo":3075,"run_molmo":3076,"allenai":3077,"0924":3078,"nemontron_vl":3079,"run_nemotron_vl":3080,"nemotron":3081,"nano":3082,"run_nvlm_d":3083,"run_ovis":3084,"paligemma":3085,"run_paligemma":3086,"vqa":3087,"caption":3088,"mix":3089,"224":3090,"run_paligemma2":3091,"paligemma2":3092,"ft":3093,"docci":3094,"run_phi3v":3095,"image_1":3096,"5120":3097,"run_pixtral_hf":3098,"6144":3099,"run_qwen_vl":3100,"run_qwen2_vl":3101,"min_pixels":3102,"1280":3103,"run_qwen2_5_vl":3104,"vision_bos":3105,"vision_eos":3106,"skyworkr1v":3107,"run_skyworkr1v":3108,"skywork":3109,"r1v":3110,"38b":3111,"run_smolvlm":3112,"run_step3":3113,"run_tarsier":3114,"run_tarsier2":3115,"get_multi_modal_input":3116,"cherry_blossom":3117,