{"contributing":0,"vllm":1,"you":2,"may":3,"find":4,"information":5,"about":6,"docs":7,"ai":8,"https":9,"en":10,"latest":11,"markdownlint":12,"disable":13,"md001":14,"md041":15,"align":16,"center":17,"picture":18,"source":19,"media":20,"prefers":21,"color":22,"scheme":23,"dark":24,"srcset":25,"raw":26,"githubusercontent":27,"com":28,"project":29,"main":30,"assets":31,"logos":32,"logo":33,"text":34,"png":35,"img":36,"alt":37,"src":38,"light":39,"width":40,"55":41,"h3":42,"easy":43,"fast":44,"cheap":45,"llm":46,"serving":47,"everyone":48,"href":49,"documentation":50,"blog":51,"arxiv":52,"org":53,"abs":54,"2309":55,"06180":56,"paper":57,"vllm_project":58,"twitter":59,"discuss":60,"user":61,"forum":62,"slack":63,"developer":64,"news":65,"2025":66,"08":67,"we":68,"hosted":69,"beijing":70,"meetup":71,"mp":72,"weixin":73,"qq":74,"dgkwg1wfpwgo2jcdtqqhxa":75,"focusing":76,"large":77,"scale":78,"deployment":79,"please":80,"slides":81,"here":82,"drive":83,"google":84,"folders":85,"1pid6nsflu43dzri0eatcpgxsazdvbbqf":86,"recording":87,"www":88,"chaspark":89,"live":90,"1166916873711665152":91,"05":92,"nyc":93,"lu":94,"ma":95,"c1rqyf1f":96,"presentation":97,"1_q_aw_iomjwuimf1s1ym":98,"zhjxz8cuel0ijvaquoybea":99,"edit":100,"usp":101,"sharing":102,"now":103,"under":104,"pytorch":105,"foundation":106,"announcement":107,"welcomes":108,"01":109,"excited":110,"announce":111,"alpha":112,"release":113,"v1":114,"major":115,"architectural":116,"upgrade":117,"7x":118,"speedup":119,"clean":120,"code":121,"optimized":122,"execution":123,"loop":124,"zero":125,"overhead":126,"prefix":127,"caching":128,"enhanced":129,"multimodal":130,"support":131,"more":132,"check":133,"out":134,"our":135,"post":136,"27":137,"html":138,"details":139,"summary":140,"previous":141,"04":142,"asia":143,"day":144,"sginnovate":145,"event":146,"limited":147,"availability":148,"morning":149,"evening":150,"slots":151,"remaining":152,"inaugural":153,"from":154,"team":155,"19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo":156,"03":157,"ollama":158,"inference":159,"night":160,"16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u":161,"first":162,"china":163,"n77gibl2coratqhtveazfg":164,"1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq":165,"east":166,"coast":167,"7mu4k4xx":168,"1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs":169,"slide":170,"id":171,"g31441846c39_0_0":172,"02":173,"ninth":174,"h7g3kuj9":175,"meta":176,"1jzc_pzvxrvnsfvcw":177,"v4cfxb6pn7zz2cyp_flwo05aqg":178,"amd":179,"file":180,"1zk5qejiktmlq2eqcxqzlljax3m9s7nwn":181,"view":182,"posted":183,"eighth":184,"zep56hui":185,"cloud":186,"1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4":187,"1h24phewanyrl11xy5dxubvrc9f9kkjix":188,"2024":189,"12":190,"joins":191,"ecosystem":192,"third":193,"robloxandvllmmeetup2024":194,"splashthat":195,"roblox":196,"1a":197,"47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem":198,"second":199,"ygxbpzhl":200,"ibm":201,"12mi2skabnuw5rbwxdyy":202,"hthth4imsnceoq10jdqbxga":203,"2023":204,"10":205,"a16z":206,"1ql":207,"xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s":208,"would":209,"like":210,"express":211,"sincere":212,"gratitude":213,"andreessen":214,"horowitz":215,"30":216,"supporting":217,"open":218,"community":219,"providing":220,"generous":221,"grant":222,"development":223,"research":224,"06":225,"officially":226,"released":227,"fastchat":228,"integration":229,"has":230,"powered":231,"lmsys":232,"vicuna":233,"chatbot":234,"arena":235,"chat":236,"since":237,"mid":238,"april":239,"use":240,"library":241,"originally":242,"developed":243,"sky":244,"computing":245,"lab":246,"cs":247,"berkeley":248,"edu":249,"uc":250,"evolved":251,"driven":252,"contributions":253,"both":254,"academia":255,"industry":256,"state":257,"art":258,"throughput":259,"efficient":260,"management":261,"attention":262,"key":263,"value":264,"memory":265,"pagedattention":266,"20":267,"continuous":268,"batching":269,"incoming":270,"requests":271,"model":272,"cuda":273,"hip":274,"graph":275,"quantizations":276,"gptq":277,"2210":278,"17323":279,"awq":280,"2306":281,"00978":282,"autoround":283,"05516":284,"int4":285,"int8":286,"fp8":287,"kernels":288,"including":289,"flashattention":290,"flashinfer":291,"speculative":292,"decoding":293,"chunked":294,"prefill":295,"flexible":296,"seamless":297,"popular":298,"hugging":299,"face":300,"models":301,"high":302,"various":303,"algorithms":304,"parallel":305,"sampling":306,"beam":307,"search":308,"tensor":309,"pipeline":310,"data":311,"expert":312,"parallelism":313,"distributed":314,"streaming":315,"outputs":316,"openai":317,"compatible":318,"api":319,"server":320,"nvidia":321,"gpus":322,"cpus":323,"intel":324,"powerpc":325,"tpu":326,"aws":327,"neuron":328,"multi":329,"lora":330,"seamlessly":331,"supports":332,"most":333,"huggingface":334,"transformer":335,"llms":336,"llama":337,"mixture":338,"mixtral":339,"deepseek":340,"v2":341,"v3":342,"embedding":343,"e5":344,"mistral":345,"modal":346,"llava":347,"full":348,"list":349,"supported":350,"supported_models":351,"getting":352,"started":353,"install":354,"pip":355,"getting_started":356,"installation":357,"gpu":358,"index":359,"build":360,"wheel":361,"bash":362,"visit":363,"learn":364,"contact":365,"us":366,"start":367,"technical":368,"questions":369,"feature":370,"github":371,"issues":372,"discussing":373,"fellow":374,"users":375,"coordinating":376,"security":377,"disclosures":378,"advisories":379,"collaborations":380,"partnerships":381,"lists":382,"mailto":383,"end":384,"kit":385,"wish":386,"refer":387,"repo":388,"site_name":389,"site_url":390,"env":391,"readthedocs_canonical_url":392,"repo_url":393,"edit_uri":394,"exclude_docs":395,"argparse":396,"inc":397,"md":398,"template":399,"theme":400,"name":401,"material":402,"only":403,"ico":404,"favicon":405,"palette":406,"toggle":407,"automatic":408,"mode":409,"icon":410,"brightness":411,"auto":412,"switch":413,"default":414,"primary":415,"white":416,"slate":417,"black":418,"system":419,"preference":420,"features":421,"content":422,"action":423,"copy":424,"tabs":425,"link":426,"navigation":427,"instant":428,"progress":429,"tracking":430,"sticky":431,"sections":432,"indexes":433,"top":434,"highlight":435,"share":436,"toc":437,"follow":438,"custom_dir":439,"mkdocs":440,"overrides":441,"hooks":442,"remove_announcement":443,"py":444,"generate_examples":445,"generate_argparse":446,"url_schemes":447,"markdown_extensions":448,"attr_list":449,"md_in_html":450,"admonition":451,"pymdownx":452,"superfences":453,"tabbed":454,"slugify":455,"python":456,"object":457,"apply":458,"slugs":459,"kwds":460,"case":461,"lower":462,"alternate_style":463,"true":464,"highlighting":465,"anchor_linenums":466,"line_spans":467,"__span":468,"pygments_lang_class":469,"inlinehilite":470,"snippets":471,"emoji":472,"icons":473,"emoji_index":474,"extensions":475,"twemoji":476,"emoji_generator":477,"to_svg":478,"page":479,"sidebar":480,"permalink":481,"math":482,"rendering":483,"mdx_math":484,"enable_dollar_delimiter":485,"extra_css":486,"stylesheets":487,"extra":488,"css":489,"extra_javascript":490,"javascript":491,"run_llm_widget":492,"js":493,"cdn":494,"mathjax":495,"config":496,"tex":497,"ams_html":498,"edit_and_feedback":499,"slack_and_forum":500,"makes":501,"url":502,"format":503,"rather":504,"than":505,"act":506,"dir":507,"so":508,"generates":509,"available":510,"guide":511,"configuration":512,"use_directory_urls":513,"false":514,"collect_env":515,"spdx":516,"license":517,"identifier":518,"apache":519,"filecopyrighttext":520,"copyright":521,"contributors":522,"import":523,"ctypes":524,"importlib":525,"util":526,"json":527,"logging":528,"os":529,"re":530,"shutil":531,"subprocess":532,"sys":533,"pathlib":534,"path":535,"which":536,"torch":537,"packaging":538,"version":539,"parse":540,"setuptools":541,"extension":542,"setup":543,"command":544,"build_ext":545,"setuptools_scm":546,"get_version":547,"utils":548,"cpp_extension":549,"cuda_home":550,"rocm_home":551,"def":552,"load_module_from_path":553,"module_name":554,"spec":555,"spec_from_file_location":556,"module":557,"module_from_spec":558,"modules":559,"loader":560,"exec_module":561,"return":562,"root_dir":563,"__file__":564,"parent":565,"logger":566,"getlogger":567,"__name__":568,"cannot":569,"envs":570,"directly":571,"because":572,"depends":573,"installed":574,"yet":575,"join":576,"vllm_target_device":577,"platform":578,"startswith":579,"darwin":580,"cpu":581,"warning":582,"automatically":583,"set":584,"due":585,"macos":586,"elif":587,"linux":588,"wsl":589,"building":590,"able":591,"run":592,"correctly":593,"empty":594,"none":595,"getenv":596,"fallback":597,"main_cuda_version":598,"is_sccache_available":599,"bool":600,"sccache":601,"int":602,"vllm_disable_sccache":603,"is_ccache_available":604,"ccache":605,"is_ninja_available":606,"ninja":607,"is_url_available":608,"str":609,"urllib":610,"request":611,"urlopen":612,"status":613,"try":614,"except":615,"exception":616,"200":617,"class":618,"cmakeextension":619,"__init__":620,"self":621,"cmake_lists_dir":622,"kwa":623,"super":624,"sources":625,"py_limited_api":626,"abspath":627,"cmake_build_ext":628,"dict":629,"directories":630,"have":631,"been":632,"configured":633,"did_config":634,"determine":635,"number":636,"compilation":637,"jobs":638,"optionally":639,"nvcc":640,"compile":641,"threads":642,"compute_num_jobs":643,"num_jobs":644,"either":645,"max_jobs":646,"environment":647,"variable":648,"defined":649,"info":650,"using":651,"else":652,"sched_getaffinity":653,"isn":654,"universally":655,"fall":656,"back":657,"cpu_count":658,"get":659,"error":660,"len":661,"attributeerror":662,"nvcc_threads":663,"_is_cuda":664,"get_nvcc_cuda_version":665,"11":666,"when":667,"reduce":668,"avoid":669,"overloading":670,"max":671,"perform":672,"cmake":673,"single":674,"configure":675,"ext":676,"ve":677,"already":678,"cmakelists":679,"txt":680,"exit":681,"early":682,"tool":683,"cmake_args":684,"dnvcc_threads":685,"build_tool":686,"dcmake_job_pool_compile":687,"string":688,"dcmake_job_pools":689,"whatever":690,"picks":691,"make":692,"sure":693,"dcmake_cuda_compiler":694,"bin":695,"check_call":696,"cwd":697,"build_temp":698,"build_extensions":699,"ensure":700,"present":701,"working":702,"check_output":703,"oserror":704,"raise":705,"runtimeerror":706,"executable":707,"create":708,"directory":709,"does":710,"exist":711,"exists":712,"makedirs":713,"targets":714,"target_name":715,"removeprefix":716,"vllm_flash_attn":717,"all":718,"append":719,"build_args":720,"target":721,"precompiled_build_ext":722,"disables":723,"precompiled":724,"binaries":725,"assert":726,"vllm_use_precompiled":727,"builds":728,"print":729,"skipping":730,"precompiled_wheel_utils":731,"extracts":732,"libraries":733,"other":734,"files":735,"existing":736,"staticmethod":737,"extract_precompiled_and_patch_package":738,"wheel_url_or_path":739,"tempfile":740,"zipfile":741,"temp_dir":742,"isfile":743,"wheel_filename":744,"split":745,"mkdtemp":746,"wheels":747,"wheel_path":748,"downloading":749,"urlretrieve":750,"filename":751,"package_data_patch":752,"files_to_copy":753,"_c":754,"abi3":755,"_moe_c":756,"_flashmla_c":757,"_vllm_fa2_c":758,"_vllm_fa3_c":759,"cumem_allocator":760,"compiled_regex":761,"file_members":762,"filter":763,"lambda":764,"filelist":765,"match":766,"extract":767,"target_path":768,"dirname":769,"exist_ok":770,"wb":771,"dst":772,"copyfileobj":773,"pkg":774,"replace":775,"setdefault":776,"basename":777,"finally":778,"removing":779,"temporary":780,"rmtree":781,"get_base_commit_in_main_branch":782,"force":783,"nightly":784,"mainly":785,"used":786,"ci":787,"testing":788,"vllm_test_use_precompiled_nightly_wheel":789,"commit":790,"hash":791,"upstream":792,"branch":793,"resp_json":794,"curl":795,"repos":796,"commits":797,"decode":798,"utf":799,"upstream_main_commit":800,"loads":801,"sha":802,"docker":803,"context":804,"git":805,"immutable":806,"missing":807,"vllm_docker_build_context":808,"_no_device":809,"has_cuda":810,"_is_neuron":811,"_is_tpu":812,"_is_hip":813,"rocm":814,"_is_cpu":815,"_is_xpu":816,"xpu":817,"_build_custom_ops":818,"get_rocm_version":819,"librocm":820,"core":821,"see":822,"blob":823,"d11f5c20d500f729c393680a01fa902ebf92094b":824,"rocm_version":825,"cpp":826,"l21":827,"librocm_core_file":828,"lib":829,"is_file":830,"librocm_core":831,"cdll":832,"vererrors":833,"c_uint32":834,"get_rocm_core_version":835,"getrocmversion":836,"restype":837,"argtypes":838,"pointer":839,"minor":840,"patch":841,"byref":842,"get_neuronxcc_version":843,"sysconfig":844,"site_dir":845,"get_paths":846,"purelib":847,"version_file":848,"neuronxcc":849,"executed":850,"successfully":851,"fp":852,"read":853,"regular":854,"expression":855,"__version__":856,"group":857,"could":858,"output":859,"adapted":860,"apex":861,"8b7a1ff183741dd8f9b87e7bafd04cfde99cea28":862,"nvcc_output":863,"universal_newlines":864,"release_idx":865,"nvcc_cuda_version":866,"get_gaudi_sw_version":867,"returns":868,"driver":869,"enable":870,"console":871,"printing":872,"hl":873,"smi":874,"shell":875,"capture_output":876,"enable_console":877,"returncode":878,"stdout":879,"get_vllm_version":880,"write_to":881,"_version":882,"sep":883,"dev":884,"versions":885,"might":886,"contain":887,"cuda_version":888,"cuda_version_str":889,"skip":890,"tarball":891,"required":892,"pypi":893,"sdist":894,"argv":895,"cu":896,"neuron_version":897,"neuron_version_str":898,"unknown":899,"runtime":900,"get_requirements":901,"package":902,"dependencies":903,"requirements":904,"requirements_dir":905,"_read_requirements":906,"strip":907,"resolved_requirements":908,"line":909,"common":910,"cuda_major":911,"cuda_minor":912,"modified_requirements":913,"req":914,"flash":915,"attn":916,"built":917,"continue":918,"valueerror":919,"unsupported":920,"ext_modules":921,"_rocm_c":922,"package_data":923,"typed":924,"model_executor":925,"layers":926,"fused_moe":927,"configs":928,"quantization":929,"advance":930,"wheel_location":931,"vllm_precompiled_wheel_location":932,"wheel_url":933,"base_commit":934,"cp38":935,"manylinux1_x86_64":936,"whl":937,"resp":938,"warn":939,"falling":940,"items":941,"extend":942,"cmdclass":943,"glob":944,"requires_files":945,"pyproject":946,"toml":947,"cleaning":948,"lines":949,"readlines":950,"removed":951,"write":952,"done":953,"certificate":954,"origin":955,"2004":956,"2006":957,"its":958,"permitted":959,"distribute":960,"verbatim":961,"copies":962,"document":963,"changing":964,"allowed":965,"making":966,"contribution":967,"certify":968,"created":969,"whole":970,"part":971,"me":972,"right":973,"submit":974,"indicated":975,"based":976,"upon":977,"work":978,"best":979,"my":980,"knowledge":981,"covered":982,"appropriate":983,"modifications":984,"whether":985,"same":986,"unless":987,"am":988,"different":989,"provided":990,"some":991,"person":992,"who":993,"certified":994,"modified":995,"understand":996,"agree":997,"public":998,"record":999,"personal":1000,"sign":1001,"off":1002,"maintained":1003,"indefinitely":1004,"redistributed":1005,"consistent":1006,"involved":1007,"january":1008,"http":1009,"licenses":1010,"terms":1011,"conditions":1012,"reproduction":1013,"distribution":1014,"definitions":1015,"shall":1016,"mean":1017,"through":1018,"licensor":1019,"owner":1020,"entity":1021,"authorized":1022,"granting":1023,"legal":1024,"union":1025,"acting":1026,"entities":1027,"control":1028,"controlled":1029,"purposes":1030,"definition":1031,"means":1032,"power":1033,"direct":1034,"indirect":1035,"cause":1036,"direction":1037,"contract":1038,"otherwise":1039,"ii":1040,"ownership":1041,"fifty":1042,"percent":1043,"50":1044,"outstanding":1045,"shares":1046,"iii":1047,"beneficial":1048,"your":1049,"individual":1050,"exercising":1051,"permissions":1052,"granted":1053,"form":1054,"preferred":1055,"software":1056,"any":1057,"resulting":1058,"mechanical":1059,"transformation":1060,"translation":1061,"compiled":1062,"generated":1063,"conversions":1064,"types":1065,"authorship":1066,"made":1067,"notice":1068,"included":1069,"attached":1070,"example":1071,"appendix":1072,"below":1073,"derivative":1074,"works":1075,"derived":1076,"editorial":1077,"revisions":1078,"annotations":1079,"elaborations":1080,"represent":1081,"original":1082,"include":1083,"remain":1084,"separable":1085,"merely":1086,"bind":1087,"interfaces":1088,"thereof":1089,"additions":1090,"intentionally":1091,"submitted":1092,"inclusion":1093,"behalf":1094,"electronic":1095,"verbal":1096,"written":1097,"communication":1098,"sent":1099,"representatives":1100,"mailing":1101,"systems":1102,"issue":1103,"managed":1104,"purpose":1105,"improving":1106,"excluding":1107,"conspicuously":1108,"marked":1109,"designated":1110,"writing":1111,"contributor":1112,"whom":1113,"received":1114,"subsequently":1115,"incorporated":1116,"within":1117,"must":1118,"give":1119,"recipients":1120,"carry":1121,"prominent":1122,"notices":1123,"stating":1124,"changed":1125,"retain":1126,"patent":1127,"trademark":1128,"attribution":1129,"those":1130,"do":1131,"pertain":1132,"includes":1133,"readable":1134,"contained":1135,"least":1136,"one":1137,"following":1138,"places":1139,"along":1140,"display":1141,"wherever":1142,"party":1143,"normally":1144,"appear":1145,"contents":1146,"informational":1147,"modify":1148,"add":1149,"own":1150,"alongside":1151,"addendum":1152,"additional":1153,"construed":1154,"modifying":1155,"statement":1156,"provide":1157,"complies":1158,"stated":1159,"submission":1160,"explicitly":1161,"without":1162,"notwithstanding":1163,"above":1164,"nothing":1165,"herein":1166,"supersede":1167,"separate":1168,"agreement":1169,"regarding":1170,"trademarks":1171,"permission":1172,"trade":1173,"names":1174,"service":1175,"marks":1176,"product":1177,"reasonable":1178,"customary":1179,"describing":1180,"reproducing":1181,"disclaimer":1182,"warranty":1183,"applicable":1184,"law":1185,"agreed":1186,"provides":1187,"each":1188,"basis":1189,"warranties":1190,"kind":1191,"implied":1192,"limitation":1193,"title":1194,"non":1195,"infringement":1196,"merchantability":1197,"fitness":1198,"particular":1199,"solely":1200,"responsible":1201,"determining":1202,"appropriateness":1203,"redistributing":1204,"assume":1205,"risks":1206,"associated":1207,"exercise":1208,"liability":1209,"theory":1210,"tort":1211,"negligence":1212,"deliberate":1213,"grossly":1214,"negligent":1215,"acts":1216,"liable":1217,"damages":1218,"special":1219,"incidental":1220,"consequential":1221,"character":1222,"arising":1223,"result":1224,"inability":1225,"loss":1226,"goodwill":1227,"stoppage":1228,"computer":1229,"failure":1230,"malfunction":1231,"commercial":1232,"losses":1233,"even":1234,"advised":1235,"possibility":1236,"accepting":1237,"while":1238,"choose":1239,"offer":1240,"charge":1241,"fee":1242,"acceptance":1243,"indemnity":1244,"obligations":1245,"rights":1246,"however":1247,"sole":1248,"responsibility":1249,"indemnify":1250,"defend":1251,"hold":1252,"harmless":1253,"incurred":1254,"claims":1255,"asserted":1256,"against":1257,"reason":1258,"how":1259,"readthedocs":1260,"io":1261,"stable":1262,"ubuntu":1263,"22":1264,"tools":1265,"post_checkout":1266,"fetch":1267,"unshallow":1268,"yaml":1269,"declare":1270,"cmake_minimum_required":1271,"26":1272,"step":1273,"correct":1274,"location":1275,"mkdir":1276,"cd":1277,"dvllm_python_executable":1278,"python3":1279,"dcmake_install_prefix":1280,"want":1281,"manually":1282,"component":1283,"vllm_extensions":1284,"languages":1285,"cxx":1286,"can":1287,"overridden":1288,"dvllm_target_device":1289,"cache":1290,"device":1291,"backend":1292,"message":1293,"type":1294,"cmake_build_type":1295,"cmake_current_list_dir":1296,"suppress":1297,"potential":1298,"warnings":1299,"unused":1300,"specified":1301,"variables":1302,"ignoreme":1303,"vllm_python_path":1304,"prevent":1305,"cutlass":1306,"cmake_install_local_only":1307,"all_components":1308,"searched":1309,"order":1310,"selected":1311,"should":1312,"kept":1313,"sync":1314,"python_supported_versions":1315,"architectures":1316,"hip_supported_archs":1317,"gfx906":1318,"gfx908":1319,"gfx90a":1320,"gfx942":1321,"gfx950":1322,"gfx1030":1323,"gfx1100":1324,"gfx1101":1325,"gfx1200":1326,"gfx1201":1327,"expected":1328,"currently":1329,"having":1330,"incorrect":1331,"results":1332,"note":1333,"dockerfile":1334,"torch_supported_version_cuda":1335,"torch_supported_version_rocm":1336,"exactly":1337,"matches":1338,"vllm_python_executable":1339,"find_python_from_executable":1340,"fatal_error":1341,"desired":1342,"before":1343,"running":1344,"endif":1345,"update":1346,"cmake_prefix_path":1347,"append_cmake_prefix_path":1348,"find_program":1349,"nvcc_executable":1350,"cuda_found":1351,"found":1352,"also":1353,"imports":1354,"partially":1355,"customizations":1356,"need":1357,"check_language":1358,"enable_language":1359,"etc":1360,"find_package":1361,"happen":1362,"after":1363,"cmake_cuda_compiler_version":1364,"gets":1365,"version_greater_equal":1366,"cuda_supported_archs":1367,"forward":1368,"external":1369,"scripts":1370,"strequal":1371,"cpu_extension":1372,"up":1373,"language":1374,"what":1375,"hip_found":1376,"vllm_gpu_lang":1377,"per":1378,"cut":1379,"down":1380,"time":1381,"remove":1382,"cmake_cuda_flags":1383,"applied":1384,"globally":1385,"clear_cuda_arches":1386,"cuda_arch_flags":1387,"extract_unique_cuda_archs_ascending":1388,"cuda_archs":1389,"archs":1390,"cuda_archs_loose_intersection":1391,"override":1392,"detected":1393,"them":1394,"current":1395,"final":1396,"arches":1397,"stored":1398,"vllm_gpu_arches":1399,"override_gpu_arches":1400,"_supported_archs":1401,"query":1402,"flags":1403,"given":1404,"vllm_gpu_flags":1405,"get_torch_gpu_compiler_flags":1406,"vllm_ext_src":1407,"csrc":1408,"mamba":1409,"mamba_ssm":1410,"selective_scan_fwd":1411,"cache_kernels":1412,"paged_attention_v1":1413,"paged_attention_v2":1414,"merge_attn_states":1415,"vertical_slash_index":1416,"pos_encoding_kernels":1417,"activation_kernels":1418,"layernorm_kernels":1419,"layernorm_quant_kernels":1420,"sampler":1421,"cuda_view":1422,"q_gemm":1423,"compressed_tensors":1424,"int8_quant_kernels":1425,"fused_kernels":1426,"fused_layernorm_dynamic_per_token_quant":1427,"gguf":1428,"gguf_kernel":1429,"cuda_utils_kernels":1430,"custom_all_reduce":1431,"torch_bindings":1432,"cutlass_enable_headers_only":1433,"header":1434,"cutlass_revision":1435,"fetchcontent":1436,"fixes":1437,"bogus":1438,"messages":1439,"v4":1440,"revision":1441,"vllm_cutlass_src_dir":1442,"is_absolute":1443,"get_filename_component":1444,"absolute":1445,"fetchcontent_declare":1446,"source_dir":1447,"git_repository":1448,"keep":1449,"git_tag":1450,"git_progress":1451,"speed":1452,"download":1453,"retrieving":1454,"instead":1455,"history":1456,"important":1457,"git_shallow":1458,"enabled":1459,"tags":1460,"updated":1461,"fetchcontent_makeavailable":1462,"gemm_kernels":1463,"permute_cols":1464,"cutlass_w8a8":1465,"scaled_mm_entry":1466,"fp4":1467,"nvfp4_quant_entry":1468,"nvfp4_scaled_mm_entry":1469,"nvfp4_blockwise_moe_kernel":1470,"sparse":1471,"sparse_scaled_mm_entry":1472,"cutlass_extensions":1473,"mla":1474,"cutlass_mla_entry":1475,"per_token_group_quant":1476,"set_gencode_flags_for_srcs":1477,"srcs":1478,"marlin":1479,"sizes":1480,"shapes":1481,"machete":1482,"bf16":1483,"atomicadd":1484,"ptx":1485,"marlin_archs":1486,"generate":1487,"preselected":1488,"input":1489,"pairs":1490,"schedules":1491,"marlin_gen_script":1492,"cmake_current_source_dir":1493,"gptq_marlin":1494,"generate_kernels":1495,"md5":1496,"marlin_gen_script_hash":1497,"generation":1498,"script":1499,"last":1500,"marlin_template_kernel_src":1501,"marlin_srcs":1502,"dense":1503,"marlin_cuda_kernel":1504,"marlin_24_cuda_kernel":1505,"qqq":1506,"marlin_qqq_gemm_kernel":1507,"gptq_marlin_repack":1508,"awq_marlin_repack":1509,"set_source_files_properties":1510,"properties":1511,"compile_flags":1512,"static":1513,"global":1514,"stub":1515,"allspark":1516,"allspark_archs":1517,"allspark_srcs":1518,"gptq_allspark":1519,"allspark_repack":1520,"allspark_qgemm_w8a16":1521,"scaled_mm_3x_archs":1522,"cutlass_scaled_mm":1523,"hopper":1524,"c3x":1525,"require":1526,"later":1527,"scaled_mm_archs":1528,"0a":1529,"scaled_mm_c3x_sm90":1530,"scaled_mm_sm90_fp8":1531,"scaled_mm_sm90_int8":1532,"scaled_mm_azp_sm90_int8":1533,"scaled_mm_blockwise_sm90_fp8":1534,"denable_scaled_mm_sm90":1535,"let":1536,"scaled_mm_c2x":1537,"know":1538,"doesn":1539,"compiler":1540,"recommend":1541,"upgrading":1542,"intend":1543,"quantized":1544,"geforce":1545,"blackwell":1546,"sm120":1547,"scaled_mm_c3x_sm120":1548,"scaled_mm_sm120_fp8":1549,"scaled_mm_blockwise_sm120_fp8":1550,"denable_scaled_mm_sm120":1551,"scaled_mm_c3x_120":1552,"sm100":1553,"scaled_mm_c3x_sm100":1554,"scaled_mm_sm100_fp8":1555,"scaled_mm_blockwise_sm100_fp8":1556,"denable_scaled_mm_sm100":1557,"scaled_mm_c3x_100":1558,"c2x":1559,"3x":1560,"scaled_mm_2x_archs":1561,"subtract":1562,"remove_item":1563,"denable_scaled_mm_c2x":1564,"scaled_mm_c3x":1565,"fp4_archs":1566,"nvfp4_quant_kernels":1567,"nvfp4_experts_quant":1568,"nvfp4_scaled_mm_kernels":1569,"denable_nvfp4_sm100":1570,"denable_cutlass_moe_sm100":1571,"nvfp4":1572,"were":1573,"clear":1574,"mla_archs":1575,"cutlass_mla_kernels":1576,"sm100_cutlass_mla_kernel":1577,"denable_cutlass_mla":1578,"specific":1579,"include_directories":1580,"cutlass_dir":1581,"examples":1582,"77_blackwell_fmha":1583,"moe":1584,"grouped_mm_c3x_sm100":1585,"grouped_mm_c3x":1586,"moe_data":1587,"cutlass_moe_data_archs":1588,"blockwise_scaled_group_mm_sm100":1589,"something":1590,"sm90a":1591,"machete_archs":1592,"machete_gen_script":1593,"machete_gen_script_hash":1594,"machete_pytorch":1595,"w4a16":1596,"quickreduce":1597,"custom_quickreduce":1598,"enabling":1599,"define_gpu_extension_target":1600,"destination":1601,"cutlass_include_dir":1602,"cutlass_tools_util_include_dir":1603,"use_sabi":1604,"with_soabi":1605,"uses":1606,"cudagetdriverentrypointbyversion":1607,"wrapper":1608,"calling":1609,"causes":1610,"problems":1611,"linking":1612,"earlier":1613,"setting":1614,"sidesteps":1615,"target_compile_definitions":1616,"private":1617,"cutlass_enable_direct_cuda_driver_call":1618,"vllm_moe_ext_src":1619,"moe_align_sum_kernels":1620,"topk_softmax_kernels":1621,"moe_wna16":1622,"moe_marlin_generation_result":1623,"equal":1624,"failed":1625,"ncheck":1626,"log":1627,"cmake_current_binary_dir":1628,"moe_marlin_generation":1629,"moe_marlin_gen_script_hash":1630,"completed":1631,"moe_wnaa16_marlin_src":1632,"marlin_moe_wna16":1633,"marlin_moe_archs":1634,"vllm_rocm_ext_src":1635,"skinny_gemms":1636,"recursive":1637,"md007":1638,"indent":1639,"md013":1640,"md024":1641,"siblings_only":1642,"md033":1643,"md042":1644,"md045":1645,"md046":1646,"md051":1647,"md052":1648,"md053":1649,"md059":1650,"rules":1651,"disabled":1652,"sc1091":1653,"sourced":1654,"shellcheck":1655,"sc2004":1656,"style":1657,"unnecessary":1658,"arithmetic":1659,"sc2129":1660,"consider":1661,"cmd1":1662,"cmd2":1663,"redirects":1664,"sc2155":1665,"assign":1666,"separately":1667,"masking":1668,"values":1669,"sc2164":1670,"fails":1671,"echo":1672,"linting":1673,"moved":1674,"sh":1675,"pre":1676,"lint":1677,"followed":1678,"linters":1679,"releasing":1680,"releases":1681,"reliable":1682,"base":1683,"packaged":1684,"binary":1685,"conveniently":1686,"accessed":1687,"via":1688,"serve":1689,"milestones":1690,"communicate":1691,"newly":1692,"improvements":1693,"upcoming":1694,"changes":1695,"affect":1696,"breaking":1697,"versioning":1698,"shifted":1699,"where":1700,"new":1701,"every":1702,"weeks":1703,"bug":1704,"opposed":1705,"semver":1706,"contains":1707,"backwards":1708,"critical":1709,"post1":1710,"_major_":1711,"milestone":1712,"incompatible":1713,"similar":1714,"_minor_":1715,"_patch_":1716,"_post1_":1717,"_patch":1718,"1_":1719,"explicit":1720,"implicit":1721,"cadence":1722,"bi":1723,"weekly":1724,"days":1725,"year":1726,"future":1727,"dates":1728,"tentative":1729,"optional":1730,"date":1731,"jan":1732,"feb":1733,"mar":1734,"apr":1735,"jun":1736,"jul":1737,"13":1738,"aug":1739,"14":1740,"15":1741,"16":1742,"17":1743,"oct":1744,"18":1745,"19":1746,"nov":1747,"21":1748,"dec":1749,"23":1750,"dedicated":1751,"coverage":1752,"llama3":1753,"llama4":1754,"hardware":1755,"h100":1756,"mi300x":1757,"_note":1758,"change":1759,"availability_":1760,"performance":1761,"validation":1762,"process":1763,"access":1764,"repository":1765,"benchmark":1766,"workflow":1767,"review":1768,"familiarize":1769,"yourself":1770,"configurations":1771,"tree":1772,"benchmarks":1773,"navigate":1774,"actions":1775,"workflows":1776,"yml":1777,"v0":1778,"rc":1779,"once":1780,"completes":1781,"dashboard":1782,"hud":1783,"reponame":1784,"2fvllm":1785,"corresponding":1786,"comparison":1787,"compare":1788,"verify":1789,"regressions":1790,"occurred":1791,"vs":1792,"starttime":1793,"thu":1794,"2c":1795,"2017":1796,"20apr":1797,"202025":1798,"2021":1799,"3a43":1800,"3a50":1801,"20gmt":1802,"stoptime":1803,"wed":1804,"2016":1805,"20jul":1806,"granularity":1807,"week":1808,"lbranch":1809,"lcommit":1810,"b6553be1bc75f046b00046a4ad7576364d03c835":1811,"rbranch":1812,"rcommit":1813,"a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f":1814,"benchmarkname":1815,"modelname":1816,"20models":1817,"backendname":1818,"20backends":1819,"modename":1820,"20modes":1821,"dtypename":1822,"20dtype":1823,"devicename":1824,"20devices":1825,"archname":1826,"20platforms":1827,"basedonstyle":1828,"usetab":1829,"never":1830,"indentwidth":1831,"columnlimit":1832,"80":1833,"pointers":1834,"derivepointeralignment":1835,"pointeralignment":1836,"left":1837,"reordering":1838,"statements":1839,"introduce":1840,"errors":1841,"sortincludes":1842,"choices":1843,"alignconsecutiveassignments":1844,"alignconsecutivedeclarations":1845,"indentppdirectives":1846,"beforehash":1847,"includecategories":1848,"regex":1849,"priority":1850,"llvm":1851,"clang":1852,"mlir":1853,"qoda":1854,"conduct":1855,"pledge":1856,"members":1857,"leaders":1858,"participation":1859,"harassment":1860,"free":1861,"experience":1862,"regardless":1863,"age":1864,"body":1865,"size":1866,"visible":1867,"invisible":1868,"disability":1869,"ethnicity":1870,"sex":1871,"characteristics":1872,"gender":1873,"identity":1874,"level":1875,"education":1876,"socioeconomic":1877,"nationality":1878,"appearance":1879,"race":1880,"caste":1881,"religion":1882,"sexual":1883,"orientation":1884,"interact":1885,"ways":1886,"contribute":1887,"welcoming":1888,"diverse":1889,"inclusive":1890,"healthy":1891,"standards":1892,"behavior":1893,"contributes":1894,"positive":1895,"demonstrating":1896,"empathy":1897,"kindness":1898,"toward":1899,"people":1900,"being":1901,"respectful":1902,"differing":1903,"opinions":1904,"viewpoints":1905,"experiences":1906,"giving":1907,"gracefully":1908,"constructive":1909,"feedback":1910,"apologizing":1911,"affected":1912,"mistakes":1913,"learning":1914,"just":1915,"individuals":1916,"overall":1917,"unacceptable":1918,"sexualized":1919,"imagery":1920,"advances":1921,"trolling":1922,"insulting":1923,"derogatory":1924,"comments":1925,"political":1926,"attacks":1927,"publishing":1928,"others":1929,"physical":1930,"email":1931,"address":1932,"reasonably":1933,"considered":1934,"inappropriate":1935,"professional":1936,"enforcement":1937,"responsibilities":1938,"clarifying":1939,"enforcing":1940,"acceptable":1941,"take":1942,"fair":1943,"corrective":1944,"response":1945,"deem":1946,"threatening":1947,"offensive":1948,"harmful":1949,"reject":1950,"wiki":1951,"edits":1952,"aligned":1953,"reasons":1954,"moderation":1955,"decisions":1956,"scope":1957,"applies":1958,"spaces":1959,"representing":1960,"official":1961,"posting":1962,"social":1963,"account":1964,"appointed":1965,"representative":1966,"online":1967,"offline":1968,"irl":1969,"instances":1970,"abusive":1971,"harassing":1972,"reported":1973,"channel":1974,"complaints":1975,"reviewed":1976,"investigated":1977,"promptly":1978,"fairly":1979,"obligated":1980,"respect":1981,"privacy":1982,"reporter":1983,"incident":1984,"guidelines":1985,"impact":1986,"consequences":1987,"violation":1988,"correction":1989,"deemed":1990,"unprofessional":1991,"unwelcome":1992,"consequence":1993,"clarity":1994,"around":1995,"nature":1996,"explanation":1997,"why":1998,"apology":1999,"requested":2000,"series":2001,"venv":2002,"dist":2003,"byte":2004,"dll":2005,"__pycache__":2006,"cod":2007,"mypy_cache":2008,"cmakeuserpresets":2009,"develop":2010,"eggs":2011,"downloads":2012,"lib64":2013,"parts":2014,"var":2015,"egg":2016,"cfg":2017,"manifest":2018,"scm":2019,"triton":2020,"jit":2021,"deps":2022,"pyinstaller":2023,"usually":2024,"exe":2025,"inject":2026,"infos":2027,"installer":2028,"logs":2029,"delete":2030,"unit":2031,"test":2032,"reports":2033,"htmlcov":2034,"tox":2035,"nox":2036,"nosetests":2037,"xml":2038,"cover":2039,"hypothesis":2040,"pytest_cache":2041,"translations":2042,"mo":2043,"pot":2044,"django":2045,"stuff":2046,"local_settings":2047,"db":2048,"sqlite3":2049,"journal":2050,"flask":2051,"instance":2052,"webassets":2053,"scrapy":2054,"pybuilder":2055,"jupyter":2056,"notebook":2057,"ipynb_checkpoints":2058,"ipython":2059,"profile_default":2060,"ipython_config":2061,"pyenv":2062,"ignore":2063,"intended":2064,"multiple":2065,"environments":2066,"pipenv":2067,"according":2068,"pypa":2069,"598":2070,"recommended":2071,"pipfile":2072,"lock":2073,"collaboration":2074,"cross":2075,"don":2076,"needed":2077,"poetry":2078,"generally":2079,"especially":2080,"packages":2081,"reproducibility":2082,"commonly":2083,"ignored":2084,"basic":2085,"usage":2086,"poetrylock":2087,"pdm":2088,"stores":2089,"wide":2090,"fming":2091,"ide":2092,"pep":2093,"582":2094,"david":2095,"oconnor":2096,"pyflow":2097,"__pypackages__":2098,"celery":2099,"celerybeat":2100,"schedule":2101,"pid":2102,"sagemath":2103,"parsed":2104,"sage":2105,"bak":2106,"spyder":2107,"settings":2108,"spyderproject":2109,"spyproject":2110,"rope":2111,"ropeproject":2112,"site":2113,"readme":2114,"mypy":2115,"dmypy":2116,"pyre":2117,"checker":2118,"pytype":2119,"analyzer":2120,"cython":2121,"debug":2122,"symbols":2123,"cython_debug":2124,"pycharm":2125,"jetbrains":2126,"gitignore":2127,"added":2128,"merged":2129,"nuclear":2130,"option":2131,"uncomment":2132,"entire":2133,"idea":2134,"folder":2135,"vscode":2136,"ds":2137,"store":2138,"ds_store":2139,"csv":2140,"pickle":2141,"pkl":2142,"sphinx":2143,"_build":2144,"vim":2145,"swap":2146,"swo":2147,"swp":2148,"_hip":2149,"hip_compat":2150,"dataset":2151,"actionlint":2152,"marlin_moe":2153,"gen":2154,"kernel_":2155,"traceback":2156,"typing":2157,"callable":2158,"unittest":2159,"mock":2160,"find_cuda_init":2161,"fn":2162,"helper":2163,"function":2164,"initialization":2165,"initializes":2166,"prints":2167,"stack":2168,"trace":2169,"happens":2170,"_lazy_init":2171,"nonlocal":2172,"extract_stack":2173,"initialized":2174,"format_list":2175,"__main__":2176,"import_module":2177,"policy":2178,"reporting":2179,"report":2180,"privately":2181,"vulnerability":2182,"triage":2183,"triaged":2184,"vulnerability_management":2185,"threat":2186,"assumptions":2187,"recommendations":2188,"securely":2189,"severity":2190,"risk":2191,"taking":2192,"dealing":2193,"past":2194,"defaults":2195,"cases":2196,"categories":2197,"vulnerabilities":2198,"allow":2199,"remote":2200,"attackers":2201,"execute":2202,"arbitrary":2203,"significantly":2204,"compromise":2205,"confidentiality":2206,"integrity":2207,"interaction":2208,"privileges":2209,"network":2210,"deserialization":2211,"exploit":2212,"chains":2213,"rated":2214,"cvss":2215,"serious":2216,"flaws":2217,"elevated":2218,"rce":2219,"contexts":2220,"significant":2221,"advanced":2222,"trust":2223,"modes":2224,"node":2225,"sort":2226,"privileged":2227,"typically":2228,"scores":2229,"between":2230,"moderate":2231,"denial":2232,"partial":2233,"disruption":2234,"breach":2235,"rating":2236,"low":2237,"mirrored":2238,"requires":2239,"24":2240,"77":2241,"jinja2":2242,"build_meta":2243,"authors":2244,"description":2245,"engine":2246,"classifiers":2247,"programming":2248,"audience":2249,"developers":2250,"technology":2251,"science":2252,"topic":2253,"scientific":2254,"engineering":2255,"artificial":2256,"intelligence":2257,"analysis":2258,"dynamic":2259,"urls":2260,"homepage":2261,"entrypoints":2262,"cli":2263,"entry":2264,"points":2265,"general_plugins":2266,"lora_filesystem_resolver":2267,"plugins":2268,"lora_resolvers":2269,"filesystem_resolver":2270,"register_filesystem_resolver":2271,"presence":2272,"enables":2273,"yapfignore":2274,"ignore_patterns":2275,"buildkite":2276,"ruff":2277,"long":2278,"length":2279,"isort":2280,"skip_glob":2281,"use_parentheses":2282,"skip_gitignore":2283,"pytest":2284,"ini_options":2285,"markers":2286,"skip_global_cleanup":2287,"core_model":2288,"pr":2289,"hybrid_model":2290,"pure":2291,"ssm":2292,"hybrid":2293,"cpu_model":2294,"tests":2295,"skip_v1":2296,"skipped":2297,"ty":2298,"root":2299,"typos":2300,"english":2301,"words":2302,"exclude":2303,"fixtures":2304,"prompts":2305,"sonnet":2306,"third_party":2307,"hidden":2308,"dot":2309,"vcs":2310,"unicode":2311,"hex":2312,"leading":2313,"digits":2314,"locale":2315,"identifiers":2316,"nvml_":2317,"unc":2318,"_thw":2319,"ue8m0":2320,"ue4m3":2321,"eles":2322,"tt":2323,"rr":2324,"bbc5b7ede":2325,"womens_doubles":2326,"v_2nd":2327,"splitted_input":2328,"noops":2329,"typ":2330,"nin_shortcut":2331,"upernetdecoder":2332,"subtile":2333,"cudadevattrmaxsharedmemoryperblockoptin":2334,"sfouput":2335,"transformers":2336,"depthwise_seperable_out_channel":2337,"depthwiseseperableconv1d":2338,"depthwise_seperable_cnn":2339,"iy":2340,"tendencias":2341,"tme":2342,"dout":2343,"pn":2344,"arange":2345,"ndarray":2346,"eoferror":2347,"fo":2348,"ba":2349,"countr_one":2350,"k_ot":2351,"ot":2352,"rust":2353,"flate2":2354,"ser":2355,"jl":2356,"modul":2357,"egals":2358,"usig":2359,"egal":2360,"default_install_hook_types":2361,"msg":2362,"default_stages":2363,"locally":2364,"manual":2365,"yapf":2366,"rev":2367,"43":2368,"args":2369,"place":2370,"verbose":2371,"failing":2372,"inputs":2373,"astral":2374,"fix":2375,"crate":2376,"34":2377,"pycqa":2378,"mirrors":2379,"v20":2380,"ggml":2381,"dequantize":2382,"cuh":2383,"vecdotq":2384,"mmq":2385,"mmvq":2386,"types_or":2387,"igorshubovych":2388,"45":2389,"stages":2390,"rhysd":2391,"uv":2392,"strategy":2393,"unsafe":2394,"cu128":2395,"local":2396,"reformat":2397,"nightly_torch_test":2398,"generate_nightly_torch_test":2399,"signoff":2400,"grep":2401,"signed":2402,"commit_editmsg":2403,"printf":2404,"nsigned":2405,"fi":2406,"headers":2407,"check_spdx_header":2408,"lazy":2409,"check_init_lazy_imports":2410,"filenames":2411,"ls":2412,"always_run":2413,"pass_filenames":2414,"dependency":2415,"enforce":2416,"enforce_regex_import":2417,"additional_dependencies":2418,"forbid":2419,"check_triton_import":2420,"cloudpickle":2421,"check_pickle_imports":2422,"pathspec":2423,"validate":2424,"open_collective":2425,"help":2426,"articles":2427,"codeowners":2428,"components":2429,"careful":2430,"backends":2431,"abstract":2432,"woosukkwon":2433,"zhuohan123":2434,"youkaichao":2435,"alexm":2436,"redhat":2437,"comaniac":2438,"njhill":2439,"llm_engine":2440,"executor":2441,"executor_base":2442,"worker":2443,"worker_base":2444,"mgoin":2445,"robertgshaw2":2446,"tlrmchlsmth":2447,"yewentao256":2448,"darklight1337":2449,"ywang96":2450,"lucaswilkinson":2451,"jeejeelee":2452,"reasoning":2453,"aarnphm":2454,"zou3519":2455,"proexpertprog":2456,"vllmconfig":2457,"facing":2458,"spam":2459,"lot":2460,"simon":2461,"houseroad":2462,"hmellor":2463,"structured_output":2464,"russellb":2465,"pull_request_rules":2466,"label":2467,"tool_parsers":2468,"transformers_utils":2469,"frontend":2470,"modality":2471,"test_vision":2472,"registry":2473,"qwen":2474,"gpt":2475,"oss":2476,"ops":2477,"_rocm":2478,"platforms":2479,"structured":2480,"structured_schemas":2481,"benchmark_serving_structured_output":2482,"run_structured_output_benchmark":2483,"structured_outputs":2484,"offline_inference":2485,"online_serving":2486,"openai_chat_completion_structured_outputs":2487,"openai_chat_completion_structured_outputs_with_reasoning":2488,"test_guided_generate":2489,"spec_decode":2490,"mlpspeculator":2491,"eagle":2492,"speculation":2493,"mlp_speculator":2494,"medusa":2495,"_tpu":2496,"tpu_":2497,"pallas":2498,"tool_use":2499,"mistral_tool_use":2500,"test_chat_with_tool_reasoning":2501,"tool_calling":2502,"tool_chat_":2503,"chat_with_tools":2504,"openai_chat_completion_client_with_tools_required":2505,"openai_chat_completion_tool_calls_with_reasoning":2506,"openai_chat_completion_client_with_tools":2507,"ping":2508,"author":2509,"conflicts":2510,"needs":2511,"rebase":2512,"conflict":2513,"closed":2514,"comment":2515,"pull":2516,"merge":2517,"resolved":2518,"collaborating":2519,"forks":2520,"syncing":2521,"fork":2522,"reviewer":2523,"tensorizer":2524,"model_loader":2525,"tensorizer_loader":2526,"test_tensorizer_entrypoint":2527,"sangstar":2528,"fill":2529,"ensuring":2530,"checklist":2531,"bottom":2532,"plan":2533,"essential":2534,"elements":2535,"effective":2536,"resolve":2537,"pasting":2538,"e2e":2539,"necessary":2540,"updating":2541,"submitting":2542,"anything":2543,"updates":2544,"maintain":2545,"interval":2546,"labels":2547,"limit":2548,"reviewers":2549,"khluu":2550,"torchvision":2551,"xformers":2552,"lm":2553,"enforcer":2554,"compressed":2555,"tensors":2556,"ray":2557,"cgraph":2558,"eval":2559,"groups":2560,"upload":2561,"asset":2562,"framework":2563,"guides":2564,"push":2565,"retrieve":2566,"tag":2567,"runs":2568,"upload_url":2569,"steps":2570,"create_release":2571,"checkout":2572,"11bd71901bbe5b1630ceea73d27597364c9af683":2573,"release_tag":2574,"github_ref":2575,"refs":2576,"github_env":2577,"60a0d83039c74a4aee543508d2ffcb1c3799cdea":2578,"v7":2579,"token":2580,"secrets":2581,"github_token":2582,"const":2583,"await":2584,"longer":2585,"matrix":2586,"fail":2587,"recent":2588,"meets":2589,"e8f9f06c4b078e705bd2ea027f0926603fc9b4d5":2590,"asset_path":2591,"wheel_name":2592,"asset_name":2593,"asset_content_type":2594,"application":2595,"danielkinz":2596,"publish":2597,"untested":2598,"gh":2599,"legacy":2600,"password":2601,"pypi_api_token":2602,"pull_request_target":2603,"auto_merge_enabled":2604,"rest":2605,"addlabels":2606,"issue_number":2607,"ready":2608,"pull_request":2609,"branches":2610,"concurrency":2611,"ref":2612,"cancel":2613,"event_name":2614,"42375524e23c412d93fb67b49958b491fce71c38":2615,"v5":2616,"matcher":2617,"matchers":2618,"2c7b3805fd2a0fd8c1884dcaebf91fc102a13ecd":2619,"extra_args":2620,"hook":2621,"stage":2622,"deploy":2623,"charts":2624,"depth":2625,"helm":2626,"azure":2627,"b9e51907a09c216f16ebe8536097933489208112":2628,"ct":2629,"yamale":2630,"yamllint":2631,"chart":2632,"0d28d3144d3a25ea2cc349d6e59901c4ff469b3b":2633,"default_branch":2634,"dirs":2635,"minio":2636,"net":2637,"9000":2638,"minio_access_key":2639,"minioadmin":2640,"minio_secret_key":2641,"tmp":2642,"export":2643,"aws_access_key_id":2644,"aws_secret_access_key":2645,"aws_ec2_metadata_disabled":2646,"opt":2647,"125m":2648,"co":2649,"facebook":2650,"pytorch_model":2651,"generation_config":2652,"merges":2653,"special_tokens_map":2654,"tokenizer_config":2655,"vocab":2656,"endpoint":2657,"127":2658,"s3":2659,"mb":2660,"testbucket":2661,"cp":2662,"cluster":2663,"a1b0e391336a6ee6713a0583f8c6240d70863de3":2664,"image":2665,"buildx":2666,"images":2667,"namespace":2668,"amazon":2669,"load":2670,"connect":2671,"ps":2672,"aqf":2673,"plane":2674,"kubectl":2675,"ns":2676,"sleep":2677,"pods":2678,"awk":2679,"wait":2680,"timeout":2681,"5m0s":2682,"s3endpoint":2683,"s3bucketname":2684,"s3accesskeyid":2685,"s3accesskey":2686,"resources":2687,"4gi":2688,"limits":2689,"5gi":2690,"vllm_cpu_kvcache_space":2691,"vllm_logging_level":2692,"vllm_cpu_ci_env":2693,"extrainit":2694,"s3modelpath":2695,"port":2696,"8001":2697,"localhost":2698,"completions":2699,"prompt":2700,"san":2701,"francisco":2702,"max_tokens":2703,"temperature":2704,"reminder":2705,"bot":2706,"opened":2707,"pr_reminder":2708,"remind":2709,"createcomment":2710,"hi":2711,"thank":2712,"reviews":2713,"coordinate":2714,"feat":2715,"channels":2716,"interest":2717,"sig":2718,"prs":2719,"trigger":2720,"fastcheck":2721,"starts":2722,"small":2723,"subset":2724,"quickly":2725,"catch":2726,"going":2727,"ui":2728,"linked":2729,"checks":2730,"section":2731,"unblock":2732,"approved":2733,"go":2734,"comprehensively":2735,"merging":2736,"cleanup":2737,"reopened":2738,"edited":2739,"cleanup_pr_body":2740,"close":2741,"inactive":2742,"daily":2743,"utc":2744,"cron":2745,"stale":2746,"5bef64f19d7facfb25b37b414482c7164d639639":2747,"v9":2748,"increasing":2749,"ensures":2750,"propagate":2751,"months":2752,"operations":2753,"1000":2754,"exempt":2755,"draft":2756,"unstale":2757,"90":2758,"had":2759,"activity":2760,"further":2761,"occurs":2762,"leave":2763,"feel":2764,"inactivity":2765,"reopen":2766,"still":2767,"relevant":2768,"problemmatcher":2769,"pattern":2770,"regexp":2771,"column":2772,"x1b":2773,"ex":2774,"tr":2775,"removes":2776,"ubuntu2004":2777,"installs":2778,"wget":2779,"nv":2780,"compute":2781,"x86_64":2782,"keyring_1":2783,"1_all":2784,"deb":2785,"sudo":2786,"dpkg":2787,"rm":2788,"apt":2789,"usr":2790,"gcc":2791,"eux":2792,"python_executable":2793,"paths":2794,"ld_library_path":2795,"oom":2796,"torch_cuda_arch_list":2797,"check_repo":2798,"bdist_wheel":2799,"pytorch_version":2800,"numpy":2801,"pyyaml":2802,"scipy":2803,"mkl":2804,"pandas":2805,"dataclasses":2806,"conda":2807,"ya":2808,"way":2809,"creation":2810,"immediately":2811,"exports":2812,"async":2813,"createrelease":2814,"generate_release_notes":2815,"prerelease":2816,"tag_name":2817,"setoutput":2818,"setfailed":2819,"lang":2820,"python_version":2821,"recommends":2822,"ca":2823,"certificates":2824,"libssl":2825,"unzip":2826,"unrar":2827,"autotools":2828,"rsync":2829,"jq":2830,"openssh":2831,"tmux":2832,"screen":2833,"htop":2834,"pdsh":2835,"client":2836,"lshw":2837,"dmidecode":2838,"automake":2839,"autoconf":2840,"libtool":2841,"pciutils":2842,"libpci":2843,"libaio":2844,"libcap2":2845,"libtinfo5":2846,"fakeroot":2847,"devscripts":2848,"debhelper":2849,"nfs":2850,"bloat":2851,"disk":2852,"space":2853,"rf":2854,"boost":2855,"agent_toolsdirectory":2856,"dotnet":2857,"eu":2858,"argument":2859,"passed":2860,"ne":2861,"pr_number":2862,"old":2863,"orig_pr_body":2864,"new_pr_body":2865,"markdown":2866,"sed":2867,"click":2868,"expand":2869,"eof":2870,"dotall":2871,"sub":2872,"cmp":2873,"cat":2874,"hit":2875,"during":2876,"attributes":2877,"hasn":2878,"addressed":2879,"searching":2880,"3aissue":2881,"3acreated":2882,"desc":2883,"textarea":2884,"paste":2885,"suggested":2886,"frequently":2887,"diagnosis":2888,"accurately":2889,"responding":2890,"validations":2891,"installing":2892,"trying":2893,"vvv":2894,"thanks":2895,"checkboxes":2896,"askllm":2897,"options":2898,"asked":2899,"living":2900,"corner":2901,"answer":2902,"lots":2903,"proposal":2904,"motivation":2905,"pitch":2906,"concise":2907,"outline":2908,"related":2909,"problem":2910,"possible":2911,"another":2912,"too":2913,"alternatives":2914,"alternative":2915,"solutions":2916,"screenshots":2917,"discussion":2918,"improve":2919,"regression":2920,"detailed":2921,"confirm":2922,"misc":2923,"think":2924,"rfc":2925,"ask":2926,"design":2927,"look":2928,"rfcs":2929,"3arfc":2930,"3aupdated":2931,"reference":2932,"proposed":2933,"period":2934,"cc":2935,"things":2936,"mention":2937,"hosts":2938,"biweekly":2939,"session":2940,"30am":2941,"pacific":2942,"discussed":2943,"slot":2944,"1cilvbzeivfr7_pnakvsusxpceywkooob78qowqhvszc":2945,"highly":2946,"pointing":2947,"gpt2":2948,"closest":2949,"difficulty":2950,"operators":2951,"architecture":2952,"blank_issues_enabled":2953,"contact_links":2954,"doc":2955,"suggest":2956,"tell":2957,"regard":2958,"put":2959,"integrate":2960,"sensitive":2961,"tokens":2962,"keys":2963,"passwords":2964,"authentication":2965,"credentials":2966,"endpoints":2967,"confidential":2968,"redacting":2969,"replacing":2970,"placeholders":2971,"your_token_here":2972,"describe":2973,"minimal":2974,"reproduce":2975,"very":2976,"snippet":2977,"succinct":2978,"trim":2979,"irrelevant":2980,"efficiently":2981,"expect":2982,"did":2983,"samplingparams":2984,"hello":2985,"president":2986,"united":2987,"states":2988,"capital":2989,"france":2990,"sampling_params":2991,"top_p":2992,"95":2993,"generated_text":2994,"hopefully":2995,"gist":2996,"observe":2997,"wrap":2998,"triple":2999,"quotes":3000,"blocks":3001,"turn":3002,"debugging":3003,"experienced":3004,"crashes":3005,"hangs":3006,"helpful":3007,"vllm_trace_function":3008,"calls":3009,"recorded":3010,"inspect":3011,"placeholder":3012,"sample":3013,"fully":3014,"qualified":3015,"test_file":3016,"test_name":3017,"params":3018,"select":3019,"flaky":3020,"caused":3021,"got":3022,"dump_input":3023,"suites":3024,"organizations":3025,"analytics":3026,"identify":3027,"methods":3028,"bisect":3029,"suspected":3030,"approximate":3031,"timeline":3032,"problematic":3033,"higher":3034,"matching":3035,"cachetools":3036,"psutil":3037,"sentencepiece":3038,"tokenizer":3039,"tqdm":3040,"blake3":3041,"cpuinfo":3042,"tokenizers":3043,"incremental":3044,"detokenization":3045,"protobuf":3046,"llamatokenizer":3047,"fastapi":3048,"standard":3049,"115":3050,"audio":3051,"transcriptions":3052,"aiohttp":3053,"99":3054,"responses":3055,"pydantic":3056,"prometheus_client":3057,"pillow":3058,"processing":3059,"prometheus":3060,"instrumentator":3061,"tiktoken":3062,"dbrx":3063,"llguidance":3064,"platform_machine":3065,"arm64":3066,"aarch64":3067,"outlines_core":3068,"outlines":3069,"diskcache":3070,"lark":3071,"xgrammar":3072,"typing_extensions":3073,"filelock":3074,"317":3075,"parser":3076,"parsing":3077,"pyzmq":3078,"25":3079,"msgspec":3080,"importlib_metadata":3081,"mistral_common":3082,"opencv":3083,"headless":3084,"video":3085,"six":3086,"transitive":3087,"modern":3088,"distutils":3089,"einops":3090,"qwen2":3091,"vl":3092,"depyf":3093,"profiling":3094,"allows":3095,"pickling":3096,"functions":3097,"rocm6":3098,"torchaudio":3099,"amdsmi":3100,"librosa":3101,"audioread":3102,"cffi":3103,"decorator":3104,"platformdirs":3105,"pooch":3106,"pycparse":3107,"soundfile":3108,"soxr":3109,"test_video":3110,"decord":3111,