{"contributing":0,"vllm":1,"you":2,"may":3,"find":4,"information":5,"about":6,"docs":7,"ai":8,"https":9,"en":10,"latest":11,"markdownlint":12,"disable":13,"md001":14,"md041":15,"align":16,"center":17,"picture":18,"source":19,"media":20,"prefers":21,"color":22,"scheme":23,"dark":24,"srcset":25,"raw":26,"githubusercontent":27,"com":28,"project":29,"main":30,"assets":31,"logos":32,"logo":33,"text":34,"png":35,"img":36,"alt":37,"src":38,"light":39,"width":40,"55":41,"h3":42,"easy":43,"fast":44,"cheap":45,"llm":46,"serving":47,"everyone":48,"href":49,"documentation":50,"blog":51,"arxiv":52,"org":53,"abs":54,"2309":55,"06180":56,"paper":57,"vllm_project":58,"twitter":59,"discuss":60,"user":61,"forum":62,"slack":63,"developer":64,"news":65,"2025":66,"08":67,"we":68,"hosted":69,"beijing":70,"meetup":71,"mp":72,"weixin":73,"qq":74,"dgkwg1wfpwgo2jcdtqqhxa":75,"focusing":76,"large":77,"scale":78,"deployment":79,"please":80,"slides":81,"here":82,"drive":83,"google":84,"folders":85,"1pid6nsflu43dzri0eatcpgxsazdvbbqf":86,"recording":87,"www":88,"chaspark":89,"live":90,"1166916873711665152":91,"05":92,"nyc":93,"lu":94,"ma":95,"c1rqyf1f":96,"presentation":97,"1_q_aw_iomjwuimf1s1ym":98,"zhjxz8cuel0ijvaquoybea":99,"edit":100,"usp":101,"sharing":102,"now":103,"under":104,"pytorch":105,"foundation":106,"announcement":107,"welcomes":108,"01":109,"excited":110,"announce":111,"alpha":112,"release":113,"v1":114,"major":115,"architectural":116,"upgrade":117,"7x":118,"speedup":119,"clean":120,"code":121,"optimized":122,"execution":123,"loop":124,"zero":125,"overhead":126,"prefix":127,"caching":128,"enhanced":129,"multimodal":130,"support":131,"more":132,"check":133,"out":134,"our":135,"post":136,"27":137,"html":138,"details":139,"summary":140,"previous":141,"04":142,"asia":143,"day":144,"sginnovate":145,"event":146,"limited":147,"availability":148,"morning":149,"evening":150,"slots":151,"remaining":152,"inaugural":153,"from":154,"team":155,"19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo":156,"03":157,"ollama":158,"inference":159,"night":160,"16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u":161,"first":162,"china":163,"n77gibl2coratqhtveazfg":164,"1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq":165,"east":166,"coast":167,"7mu4k4xx":168,"1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs":169,"slide":170,"id":171,"g31441846c39_0_0":172,"02":173,"ninth":174,"h7g3kuj9":175,"meta":176,"1jzc_pzvxrvnsfvcw":177,"v4cfxb6pn7zz2cyp_flwo05aqg":178,"amd":179,"file":180,"1zk5qejiktmlq2eqcxqzlljax3m9s7nwn":181,"view":182,"posted":183,"eighth":184,"zep56hui":185,"cloud":186,"1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4":187,"1h24phewanyrl11xy5dxubvrc9f9kkjix":188,"2024":189,"12":190,"joins":191,"ecosystem":192,"11":193,"seventh":194,"h0qvrajz":195,"snowflake":196,"1e3cxqbv3jsfgp30swyvs3em_tw":197,"ghohj9pajgk6kr54":198,"1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a":199,"10":200,"have":201,"just":202,"created":203,"coordinating":204,"contributions":205,"discussing":206,"features":207,"feel":208,"free":209,"join":210,"us":211,"ray":212,"summit":213,"held":214,"special":215,"track":216,"opening":217,"talk":218,"1b_kqxphbtra_mdf":219,"tr6i8rwdou5qotznceg2mkzxehm":220,"learn":221,"talks":222,"youtube":223,"playlist":224,"list":225,"plztswpqnepxl6aqwifuwuimlpfrvpksjr":226,"other":227,"contributors":228,"users":229,"09":230,"sixth":231,"87q3nvnh":232,"nvidia":233,"1wrlgwytqfaotd5wcgspnhoaw3nq0e":234,"9wqyp7ny93xrs":235,"07":236,"fifth":237,"lp0gyjqr":238,"aws":239,"1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y":240,"partnership":241,"officially":242,"supports":243,"llama":244,"fp8":245,"quantization":246,"pipeline":247,"parallelism":248,"23":249,"llama31":250,"06":251,"fourth":252,"agivllm":253,"cloudflare":254,"bentoml":255,"1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4":256,"third":257,"robloxandvllmmeetup2024":258,"splashthat":259,"roblox":260,"1a":261,"47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem":262,"second":263,"ygxbpzhl":264,"ibm":265,"12mi2skabnuw5rbwxdyy":266,"hthth4imsnceoq10jdqbxga":267,"2023":268,"a16z":269,"1ql":270,"xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s":271,"would":272,"like":273,"express":274,"sincere":275,"gratitude":276,"andreessen":277,"horowitz":278,"30":279,"supporting":280,"open":281,"community":282,"providing":283,"generous":284,"grant":285,"development":286,"research":287,"released":288,"fastchat":289,"integration":290,"has":291,"powered":292,"lmsys":293,"vicuna":294,"chatbot":295,"arena":296,"chat":297,"since":298,"mid":299,"april":300,"use":301,"library":302,"originally":303,"developed":304,"sky":305,"computing":306,"lab":307,"cs":308,"berkeley":309,"edu":310,"uc":311,"evolved":312,"driven":313,"both":314,"academia":315,"industry":316,"state":317,"art":318,"throughput":319,"efficient":320,"management":321,"attention":322,"key":323,"value":324,"memory":325,"pagedattention":326,"20":327,"continuous":328,"batching":329,"incoming":330,"requests":331,"model":332,"cuda":333,"hip":334,"graph":335,"quantizations":336,"gptq":337,"2210":338,"17323":339,"awq":340,"2306":341,"00978":342,"autoround":343,"05516":344,"int4":345,"int8":346,"kernels":347,"including":348,"flashattention":349,"flashinfer":350,"speculative":351,"decoding":352,"chunked":353,"prefill":354,"flexible":355,"seamless":356,"popular":357,"hugging":358,"face":359,"models":360,"high":361,"various":362,"algorithms":363,"parallel":364,"sampling":365,"beam":366,"search":367,"tensor":368,"data":369,"expert":370,"distributed":371,"streaming":372,"outputs":373,"openai":374,"compatible":375,"api":376,"server":377,"gpus":378,"cpus":379,"intel":380,"powerpc":381,"tpu":382,"neuron":383,"multi":384,"lora":385,"seamlessly":386,"most":387,"huggingface":388,"transformer":389,"llms":390,"mixture":391,"mixtral":392,"deepseek":393,"v2":394,"v3":395,"embedding":396,"e5":397,"mistral":398,"modal":399,"llava":400,"full":401,"supported":402,"supported_models":403,"getting":404,"started":405,"install":406,"pip":407,"getting_started":408,"installation":409,"gpu":410,"index":411,"build":412,"wheel":413,"bash":414,"visit":415,"quickstart":416,"welcome":417,"any":418,"collaborations":419,"how":420,"get":421,"involved":422,"sponsors":423,"compute":424,"resources":425,"testing":426,"following":427,"organizations":428,"thank":429,"your":430,"note":431,"sort":432,"them":433,"alphabetical":434,"order":435,"keep":436,"consistent":437,"md":438,"cash":439,"donations":440,"dropbox":441,"sequoia":442,"capital":443,"skywork":444,"zhenfund":445,"alibaba":446,"anyscale":447,"crusoe":448,"databricks":449,"deepinfra":450,"lambda":451,"nebius":452,"novita":453,"replicate":454,"runpod":455,"trainy":456,"san":457,"diego":458,"sponsor":459,"also":460,"official":461,"fundraising":462,"venue":463,"through":464,"opencollective":465,"plan":466,"fund":467,"maintenance":468,"adoption":469,"citation":470,"cite":471,"bibtex":472,"inproceedings":473,"kwon2023efficient":474,"title":475,"language":476,"author":477,"woosuk":478,"kwon":479,"zhuohan":480,"li":481,"siyuan":482,"zhuang":483,"ying":484,"sheng":485,"lianmin":486,"zheng":487,"cody":488,"hao":489,"yu":490,"joseph":491,"gonzalez":492,"zhang":493,"ion":494,"stoica":495,"booktitle":496,"proceedings":497,"acm":498,"sigops":499,"29th":500,"symposium":501,"operating":502,"systems":503,"principles":504,"year":505,"contact":506,"start":507,"technical":508,"questions":509,"feature":510,"github":511,"issues":512,"fellow":513,"security":514,"disclosures":515,"advisories":516,"partnerships":517,"lists":518,"mailto":519,"end":520,"kit":521,"wish":522,"refer":523,"repo":524,"spdx":525,"license":526,"identifier":527,"apache":528,"filecopyrighttext":529,"copyright":530,"import":531,"ctypes":532,"importlib":533,"util":534,"json":535,"logging":536,"os":537,"re":538,"shutil":539,"subprocess":540,"sys":541,"pathlib":542,"path":543,"which":544,"torch":545,"packaging":546,"version":547,"parse":548,"setuptools":549,"extension":550,"setup":551,"command":552,"build_ext":553,"setuptools_scm":554,"get_version":555,"utils":556,"cpp_extension":557,"cuda_home":558,"rocm_home":559,"def":560,"load_module_from_path":561,"module_name":562,"spec":563,"spec_from_file_location":564,"module":565,"module_from_spec":566,"modules":567,"loader":568,"exec_module":569,"return":570,"root_dir":571,"__file__":572,"parent":573,"logger":574,"getlogger":575,"__name__":576,"cannot":577,"envs":578,"directly":579,"because":580,"depends":581,"installed":582,"yet":583,"py":584,"vllm_target_device":585,"platform":586,"startswith":587,"darwin":588,"cpu":589,"warning":590,"automatically":591,"set":592,"due":593,"macos":594,"elif":595,"linux":596,"only":597,"wsl":598,"building":599,"so":600,"able":601,"run":602,"correctly":603,"empty":604,"none":605,"getenv":606,"available":607,"fallback":608,"main_cuda_version":609,"is_sccache_available":610,"bool":611,"sccache":612,"int":613,"vllm_disable_sccache":614,"is_ccache_available":615,"ccache":616,"is_ninja_available":617,"ninja":618,"is_url_available":619,"url":620,"str":621,"urllib":622,"request":623,"urlopen":624,"status":625,"try":626,"except":627,"exception":628,"false":629,"200":630,"class":631,"cmakeextension":632,"__init__":633,"self":634,"name":635,"cmake_lists_dir":636,"kwa":637,"super":638,"sources":639,"py_limited_api":640,"true":641,"abspath":642,"cmake_build_ext":643,"dict":644,"directories":645,"been":646,"configured":647,"did_config":648,"determine":649,"number":650,"compilation":651,"jobs":652,"optionally":653,"nvcc":654,"compile":655,"threads":656,"compute_num_jobs":657,"num_jobs":658,"either":659,"max_jobs":660,"environment":661,"variable":662,"defined":663,"info":664,"using":665,"else":666,"sched_getaffinity":667,"isn":668,"universally":669,"fall":670,"back":671,"cpu_count":672,"error":673,"len":674,"attributeerror":675,"nvcc_threads":676,"_is_cuda":677,"get_nvcc_cuda_version":678,"when":679,"reduce":680,"avoid":681,"overloading":682,"system":683,"max":684,"perform":685,"cmake":686,"configuration":687,"single":688,"configure":689,"ext":690,"ve":691,"already":692,"cmakelists":693,"txt":694,"exit":695,"early":696,"select":697,"type":698,"optimization":699,"level":700,"debug":701,"default_cfg":702,"relwithdebinfo":703,"cfg":704,"cmake_build_type":705,"cmake_args":706,"dcmake_build_type":707,"format":708,"dvllm_target_device":709,"verbose":710,"dcmake_verbose_makefile":711,"dcmake_c_compiler_launcher":712,"dcmake_cxx_compiler_launcher":713,"dcmake_cuda_compiler_launcher":714,"dcmake_hip_compiler_launcher":715,"pass":716,"python":717,"executable":718,"can":719,"exact":720,"match":721,"dvllm_python_executable":722,"reuse":723,"dependencies":724,"subsequent":725,"calls":726,"dvllm_python_path":727,"override":728,"base":729,"directory":730,"fetchcontent":731,"downloads":732,"root":733,"deps":734,"allows":735,"between":736,"profiles":737,"plays":738,"nicely":739,"fetchcontent_base_dir":740,"fc_base_dir":741,"environ":742,"dfetchcontent_base_dir":743,"tool":744,"dnvcc_threads":745,"build_tool":746,"dcmake_job_pool_compile":747,"string":748,"dcmake_job_pools":749,"default":750,"whatever":751,"picks":752,"make":753,"sure":754,"dcmake_cuda_compiler":755,"bin":756,"check_call":757,"cwd":758,"build_temp":759,"build_extensions":760,"ensure":761,"present":762,"working":763,"check_output":764,"oserror":765,"raise":766,"runtimeerror":767,"create":768,"does":769,"exist":770,"exists":771,"makedirs":772,"targets":773,"target_name":774,"removeprefix":775,"vllm_flash_attn":776,"all":777,"extensions":778,"append":779,"build_args":780,"target":781,"libraries":782,"proper":783,"location":784,"outdir":785,"get_ext_fullpath":786,"absolute":787,"skip":788,"same":789,"continue":790,"appends":791,"contains":792,"need":793,"remove":794,"range":795,"count":796,"should":797,"actually":798,"components":799,"install_args":800,"component":801,"standard":802,"copy":803,"build_lib":804,"current":805,"included":806,"editable":807,"glob":808,"files":809,"recursive":810,"dst_file":811,"split":812,"print":813,"copying":814,"dirname":815,"exist_ok":816,"copy_file":817,"precompiled_build_ext":818,"disables":819,"precompiled":820,"binaries":821,"assert":822,"vllm_use_precompiled":823,"builds":824,"skipping":825,"precompiled_wheel_utils":826,"extracts":827,"existing":828,"staticmethod":829,"extract_precompiled_and_patch_package":830,"wheel_url_or_path":831,"tempfile":832,"zipfile":833,"temp_dir":834,"isfile":835,"wheel_filename":836,"mkdtemp":837,"wheels":838,"wheel_path":839,"downloading":840,"urlretrieve":841,"filename":842,"package_data_patch":843,"files_to_copy":844,"_c":845,"abi3":846,"_moe_c":847,"_flashmla_c":848,"_vllm_fa2_c":849,"_vllm_fa3_c":850,"cumem_allocator":851,"compiled_regex":852,"file_members":853,"filter":854,"filelist":855,"extract":856,"target_path":857,"wb":858,"dst":859,"copyfileobj":860,"pkg":861,"replace":862,"setdefault":863,"basename":864,"finally":865,"removing":866,"temporary":867,"rmtree":868,"get_base_commit_in_main_branch":869,"force":870,"nightly":871,"mainly":872,"used":873,"ci":874,"vllm_test_use_precompiled_nightly_wheel":875,"commit":876,"hash":877,"upstream":878,"branch":879,"resp_json":880,"curl":881,"repos":882,"commits":883,"decode":884,"utf":885,"upstream_main_commit":886,"loads":887,"sha":888,"docker":889,"context":890,"git":891,"immutable":892,"missing":893,"vllm_docker_build_context":894,"local":895,"cat":896,"calledprocesserror":897,"fetch":898,"remote":899,"repository":900,"update":901,"branches":902,"ensures":903,"ref":904,"its":905,"history":906,"current_branch":907,"show":908,"strip":909,"base_commit":910,"merge":911,"valueerror":912,"err":913,"failed":914,"dev":915,"_no_device":916,"has_cuda":917,"_is_neuron":918,"_is_tpu":919,"_is_hip":920,"rocm":921,"_is_cpu":922,"_is_xpu":923,"xpu":924,"_build_custom_ops":925,"get_rocm_version":926,"librocm":927,"core":928,"see":929,"blob":930,"d11f5c20d500f729c393680a01fa902ebf92094b":931,"rocm_version":932,"cpp":933,"l21":934,"librocm_core_file":935,"lib":936,"is_file":937,"librocm_core":938,"cdll":939,"vererrors":940,"c_uint32":941,"get_rocm_core_version":942,"getrocmversion":943,"restype":944,"argtypes":945,"pointer":946,"minor":947,"patch":948,"byref":949,"get_neuronxcc_version":950,"sysconfig":951,"site_dir":952,"get_paths":953,"purelib":954,"version_file":955,"neuronxcc":956,"executed":957,"successfully":958,"fp":959,"content":960,"read":961,"regular":962,"expression":963,"__version__":964,"group":965,"could":966,"output":967,"adapted":968,"apex":969,"8b7a1ff183741dd8f9b87e7bafd04cfde99cea28":970,"nvcc_output":971,"universal_newlines":972,"release_idx":973,"nvcc_cuda_version":974,"get_gaudi_sw_version":975,"returns":976,"driver":977,"enable":978,"console":979,"printing":980,"hl":981,"smi":982,"shell":983,"capture_output":984,"env":985,"enable_console":986,"returncode":987,"stdout":988,"get_vllm_version":989,"write_to":990,"_version":991,"sep":992,"versions":993,"might":994,"contain":995,"cuda_version":996,"cuda_version_str":997,"tarball":998,"required":999,"pypi":1000,"sdist":1001,"argv":1002,"cu":1003,"neuron_version":1004,"neuron_version_str":1005,"unknown":1006,"runtime":1007,"get_requirements":1008,"package":1009,"requirements":1010,"requirements_dir":1011,"_read_requirements":1012,"resolved_requirements":1013,"line":1014,"common":1015,"cuda_major":1016,"cuda_minor":1017,"modified_requirements":1018,"req":1019,"flash":1020,"attn":1021,"built":1022,"unsupported":1023,"ext_modules":1024,"_rocm_c":1025,"fa3":1026,"requires":1027,"later":1028,"optional":1029,"doesn":1030,"produce":1031,"targeting":1032,"hopper":1033,"package_data":1034,"typed":1035,"model_executor":1036,"layers":1037,"fused_moe":1038,"configs":1039,"advance":1040,"wheel_location":1041,"vllm_precompiled_wheel_location":1042,"wheel_url":1043,"cp38":1044,"manylinux1_x86_64":1045,"whl":1046,"resp":1047,"warn":1048,"falling":1049,"items":1050,"extend":1051,"cmdclass":1052,"static":1053,"metadata":1054,"rather":1055,"go":1056,"pyproject":1057,"toml":1058,"install_requires":1059,"extras_require":1060,"bench":1061,"pandas":1062,"datasets":1063,"tensorizer":1064,"fastsafetensors":1065,"runai":1066,"streamer":1067,"13":1068,"s3":1069,"boto3":1070,"audio":1071,"librosa":1072,"soundfile":1073,"mistral_common":1074,"processing":1075,"video":1076,"kept":1077,"backwards":1078,"compatibility":1079,"updated":1080,"together":1081,"dockerfile":1082,"requires_files":1083,"cleaning":1084,"lines":1085,"readlines":1086,"lower":1087,"removed":1088,"write":1089,"done":1090,"releasing":1091,"releases":1092,"offer":1093,"reliable":1094,"packaged":1095,"binary":1096,"conveniently":1097,"accessed":1098,"via":1099,"serve":1100,"milestones":1101,"communicate":1102,"newly":1103,"improvements":1104,"upcoming":1105,"changes":1106,"affect":1107,"potential":1108,"breaking":1109,"versioning":1110,"uses":1111,"right":1112,"shifted":1113,"where":1114,"new":1115,"every":1116,"weeks":1117,"bug":1118,"fixes":1119,"opposed":1120,"semver":1121,"critical":1122,"made":1123,"post1":1124,"_major_":1125,"milestone":1126,"incompatible":1127,"similar":1128,"_minor_":1129,"_patch_":1130,"_post1_":1131,"_patch":1132,"1_":1133,"explicit":1134,"implicit":1135,"cadence":1136,"bi":1137,"weekly":1138,"basis":1139,"days":1140,"after":1141,"future":1142,"dates":1143,"below":1144,"tentative":1145,"date":1146,"jan":1147,"feb":1148,"mar":1149,"apr":1150,"jun":1151,"jul":1152,"aug":1153,"14":1154,"15":1155,"16":1156,"17":1157,"oct":1158,"18":1159,"19":1160,"nov":1161,"21":1162,"dec":1163,"22":1164,"each":1165,"dedicated":1166,"cut":1167,"performed":1168,"before":1169,"previously":1170,"reused":1171,"triggered":1172,"push":1173,"rc":1174,"tag":1175,"vx":1176,"rc1":1177,"enables":1178,"test":1179,"multiple":1180,"rcs":1181,"final":1182,"trigger":1183,"notes":1184,"monitor":1185,"reverts":1186,"apply":1187,"cherry":1188,"pick":1189,"criteria":1190,"approach":1191,"finalizing":1192,"clear":1193,"what":1194,"allowed":1195,"process":1196,"land":1197,"pr":1198,"typically":1199,"sufficient":1200,"time":1201,"complete":1202,"thorough":1203,"round":1204,"stable":1205,"regression":1206,"address":1207,"functional":1208,"performance":1209,"against":1210,"recent":1211,"severe":1212,"issue":1213,"silent":1214,"incorrectness":1215,"crashes":1216,"deadlocks":1217,"leaks":1218,"introduced":1219,"specific":1220,"change":1221,"identifiers":1222,"work":1223,"prs":1224,"considered":1225,"merged":1226,"trunk":1227,"manual":1228,"validations":1229,"e2e":1230,"validation":1231,"regressions":1232,"benchmark":1233,"workflow":1234,"actions":1235,"workflows":1236,"yml":1237,"coverage":1238,"llama3":1239,"llama4":1240,"hardware":1241,"h100":1242,"mi300x":1243,"_note":1244,"based":1245,"availability_":1246,"step":1247,"access":1248,"review":1249,"familiarize":1250,"yourself":1251,"configurations":1252,"tree":1253,"benchmarks":1254,"navigate":1255,"v0":1256,"results":1257,"once":1258,"completes":1259,"dashboard":1260,"hud":1261,"reponame":1262,"2fvllm":1263,"corresponding":1264,"comparison":1265,"compare":1266,"verify":1267,"occurred":1268,"example":1269,"vs":1270,"starttime":1271,"thu":1272,"2c":1273,"2017":1274,"20apr":1275,"202025":1276,"2021":1277,"3a43":1278,"3a50":1279,"20gmt":1280,"stoptime":1281,"wed":1282,"2016":1283,"20jul":1284,"granularity":1285,"week":1286,"lbranch":1287,"lcommit":1288,"b6553be1bc75f046b00046a4ad7576364d03c835":1289,"rbranch":1290,"rcommit":1291,"a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f":1292,"benchmarkname":1293,"modelname":1294,"20models":1295,"backendname":1296,"20backends":1297,"modename":1298,"20modes":1299,"dtypename":1300,"20dtype":1301,"devicename":1302,"20devices":1303,"archname":1304,"20platforms":1305,"conduct":1306,"pledge":1307,"members":1308,"leaders":1309,"participation":1310,"harassment":1311,"experience":1312,"regardless":1313,"age":1314,"body":1315,"size":1316,"visible":1317,"invisible":1318,"disability":1319,"ethnicity":1320,"sex":1321,"characteristics":1322,"gender":1323,"identity":1324,"education":1325,"socioeconomic":1326,"nationality":1327,"personal":1328,"appearance":1329,"race":1330,"caste":1331,"religion":1332,"sexual":1333,"orientation":1334,"act":1335,"interact":1336,"ways":1337,"contribute":1338,"welcoming":1339,"diverse":1340,"inclusive":1341,"healthy":1342,"standards":1343,"examples":1344,"behavior":1345,"contributes":1346,"positive":1347,"include":1348,"demonstrating":1349,"empathy":1350,"kindness":1351,"toward":1352,"people":1353,"being":1354,"respectful":1355,"differing":1356,"opinions":1357,"viewpoints":1358,"experiences":1359,"giving":1360,"gracefully":1361,"accepting":1362,"constructive":1363,"feedback":1364,"responsibility":1365,"apologizing":1366,"those":1367,"affected":1368,"mistakes":1369,"learning":1370,"best":1371,"individuals":1372,"overall":1373,"unacceptable":1374,"sexualized":1375,"imagery":1376,"advances":1377,"kind":1378,"trolling":1379,"insulting":1380,"derogatory":1381,"comments":1382,"political":1383,"attacks":1384,"public":1385,"private":1386,"publishing":1387,"others":1388,"physical":1389,"email":1390,"without":1391,"permission":1392,"reasonably":1393,"inappropriate":1394,"professional":1395,"setting":1396,"enforcement":1397,"responsibilities":1398,"responsible":1399,"clarifying":1400,"enforcing":1401,"acceptable":1402,"take":1403,"appropriate":1404,"fair":1405,"corrective":1406,"action":1407,"response":1408,"deem":1409,"threatening":1410,"offensive":1411,"harmful":1412,"reject":1413,"wiki":1414,"edits":1415,"aligned":1416,"reasons":1417,"moderation":1418,"decisions":1419,"scope":1420,"applies":1421,"within":1422,"spaces":1423,"individual":1424,"representing":1425,"posting":1426,"social":1427,"account":1428,"acting":1429,"appointed":1430,"representative":1431,"online":1432,"offline":1433,"irl":1434,"instances":1435,"abusive":1436,"harassing":1437,"otherwise":1438,"reported":1439,"channel":1440,"complaints":1441,"reviewed":1442,"investigated":1443,"promptly":1444,"fairly":1445,"obligated":1446,"respect":1447,"privacy":1448,"reporter":1449,"incident":1450,"guidelines":1451,"follow":1452,"impact":1453,"determining":1454,"consequences":1455,"violation":1456,"correction":1457,"deemed":1458,"unprofessional":1459,"unwelcome":1460,"consequence":1461,"written":1462,"clarity":1463,"around":1464,"nature":1465,"explanation":1466,"why":1467,"apology":1468,"requested":1469,"series":1470,"continued":1471,"interaction":1472,"unsolicited":1473,"specified":1474,"period":1475,"includes":1476,"avoiding":1477,"interactions":1478,"well":1479,"external":1480,"channels":1481,"violating":1482,"terms":1483,"lead":1484,"permanent":1485,"ban":1486,"serious":1487,"sustained":1488,"communication":1489,"during":1490,"pattern":1491,"aggression":1492,"disparagement":1493,"classes":1494,"attribution":1495,"contributor":1496,"covenant":1497,"code_of_conduct":1498,"were":1499,"inspired":1500,"mozilla":1501,"ladder":1502,"inclusion":1503,"answers":1504,"faq":1505,"translations":1506,"traceback":1507,"typing":1508,"callable":1509,"unittest":1510,"mock":1511,"find_cuda_init":1512,"fn":1513,"object":1514,"helper":1515,"function":1516,"initialization":1517,"errors":1518,"initializes":1519,"prints":1520,"stack":1521,"trace":1522,"happens":1523,"_lazy_init":1524,"wrapper":1525,"nonlocal":1526,"extract_stack":1527,"initialized":1528,"format_list":1529,"__main__":1530,"import_module":1531,"policy":1532,"reporting":1533,"report":1534,"privately":1535,"vulnerability":1536,"submission":1537,"form":1538,"triage":1539,"reports":1540,"triaged":1541,"vulnerability_management":1542,"threat":1543,"guide":1544,"usage":1545,"assumptions":1546,"recommendations":1547,"securely":1548,"severity":1549,"risk":1550,"taking":1551,"dealing":1552,"past":1553,"defaults":1554,"cases":1555,"categories":1556,"vulnerabilities":1557,"allow":1558,"attackers":1559,"execute":1560,"arbitrary":1561,"control":1562,"significantly":1563,"compromise":1564,"confidentiality":1565,"integrity":1566,"privileges":1567,"needed":1568,"network":1569,"deserialization":1570,"exploit":1571,"chains":1572,"generally":1573,"rated":1574,"cvss":1575,"flaws":1576,"elevated":1577,"rce":1578,"contexts":1579,"significant":1580,"loss":1581,"require":1582,"advanced":1583,"conditions":1584,"some":1585,"trust":1586,"modes":1587,"node":1588,"privileged":1589,"scores":1590,"moderate":1591,"cause":1592,"denial":1593,"service":1594,"partial":1595,"disruption":1596,"do":1597,"breach":1598,"rating":1599,"low":1600,"informational":1601,"non":1602,"exploitable":1603,"weaknesses":1604,"privilege":1605,"negligible":1606,"side":1607,"collisions":1608,"often":1609,"less":1610,"than":1611,"prenotification":1612,"certain":1613,"prenotify":1614,"vendors":1615,"ship":1616,"purpose":1617,"coordinated":1618,"notification":1619,"adding":1620,"contacts":1621,"advisory":1622,"few":1623,"added":1624,"send":1625,"vendor":1626,"analyzed":1627,"case":1628,"withdraw":1629,"receiving":1630,"prenotifications":1631,"membership":1632,"refinements":1633,"who":1634,"fill":1635,"description":1636,"ensuring":1637,"checklist":1638,"bottom":1639,"result":1640,"essential":1641,"elements":1642,"effective":1643,"fix":1644,"link":1645,"resolve":1646,"pasting":1647,"necessary":1648,"updating":1649,"submitting":1650,"anything":1651,"samplingparams":1652,"creates":1653,"xla":1654,"hlo":1655,"graphs":1656,"length":1657,"buckets":1658,"neuron_context_length_buckets":1659,"128":1660,"512":1661,"1024":1662,"2048":1663,"token":1664,"gen":1665,"neuron_token_gen_buckets":1666,"quantizes":1667,"weight":1668,"config":1669,"dtype":1670,"neuron_quant_dtype":1671,"s8":1672,"sample":1673,"prompts":1674,"hello":1675,"my":1676,"president":1677,"united":1678,"states":1679,"france":1680,"params":1681,"sampling_params":1682,"temperature":1683,"top_p":1684,"95":1685,"tinyllama":1686,"1b":1687,"max_num_seqs":1688,"max_model_len":1689,"block_size":1690,"arguments":1691,"sequence":1692,"device":1693,"currently":1694,"known":1695,"limitation":1696,"transformers":1697,"neuronx":1698,"todo":1699,"liangfu":1700,"paged":1701,"ruff":1702,"noqa":1703,"e501":1704,"detected":1705,"sdk":1706,"argument":1707,"unspecified":1708,"automated":1709,"detection":1710,"explicitly":1711,"assigned":1712,"neuron_quant":1713,"override_neuron_config":1714,"cast_logits_dtype":1715,"bfloat16":1716,"tensor_parallel_size":1717,"generate":1718,"texts":1719,"requestoutput":1720,"objects":1721,"prompt":1722,"generated":1723,"50":1724,"generated_text":1725,"ngenerated":1726,"saves":1727,"worker":1728,"checkpoint":1729,"load":1730,"needs":1731,"own":1732,"shard":1733,"entire":1734,"save_sharded_state":1735,"deepspeedfp":1736,"save":1737,"loaded":1738,"load_format":1739,"sharded_state":1740,"dataclasses":1741,"engineargs":1742,"model_loader":1743,"shardedstateloader":1744,"flexibleargumentparser":1745,"parse_args":1746,"parser":1747,"add_cli_args":1748,"add_argument":1749,"help":1750,"default_pattern":1751,"saved":1752,"filenames":1753,"bytes":1754,"safetensors":1755,"args":1756,"engine_args":1757,"from_cli_args":1758,"enable_lora":1759,"saving":1760,"model_path":1761,"is_dir":1762,"must":1763,"instance":1764,"asdict":1765,"prepare":1766,"mkdir":1767,"dump":1768,"engine":1769,"is_v1_engine":1770,"hasattr":1771,"llm_engine":1772,"engine_core":1773,"file_pattern":1774,"max_size":1775,"max_file_size":1776,"listdir":1777,"splitext":1778,"pt":1779,"isdir":1780,"copytree":1781,"offline_inference":1782,"data_parallel":1783,"powermoe":1784,"3b":1785,"dp":1786,"tp":1787,"assume":1788,"ip":1789,"99":1790,"48":1791,"rank":1792,"master":1793,"addr":1794,"port":1795,"13345":1796,"sleep":1797,"get_open_port":1798,"argparse":1799,"argumentparser":1800,"total":1801,"nodes":1802,"enforce":1803,"eager":1804,"store_true":1805,"mode":1806,"num":1807,"seqs":1808,"64":1809,"maximum":1810,"sequences":1811,"processed":1812,"iteration":1813,"tokens":1814,"timeout":1815,"300":1816,"seconds":1817,"unresponsive":1818,"killed":1819,"utilization":1820,"float":1821,"fraction":1822,"allocate":1823,"dp_size":1824,"local_dp_rank":1825,"global_dp_rank":1826,"dp_master_ip":1827,"dp_master_port":1828,"gpus_per_dp_rank":1829,"enforce_eager":1830,"trust_remote_code":1831,"gpu_memory_utilization":1832,"vllm_dp_rank":1833,"vllm_dp_rank_local":1834,"vllm_dp_size":1835,"vllm_dp_master_ip":1836,"vllm_dp_master_port":1837,"cuda_visible_devices":1838,"inside":1839,"processes":1840,"100":1841,"different":1842,"usually":1843,"ranks":1844,"dataset":1845,"part":1846,"floor":1847,"remainder":1848,"distribute":1849,"even":1850,"groups":1851,"min":1852,"placeholder":1853,"doing":1854,"max_tokens":1855,"demonstration":1856,"enable_expert_parallel":1857,"enumerate":1858,"break":1859,"give":1860,"engines":1861,"pause":1862,"loops":1863,"exiting":1864,"tp_size":1865,"node_size":1866,"node_rank":1867,"127":1868,"master_addr":1869,"master_port":1870,"divisible":1871,"dp_per_node":1872,"multiprocessing":1873,"procs":1874,"proc":1875,"exit_code":1876,"exitcode":1877,"killing":1878,"pid":1879,"didn":1880,"stop":1881,"minutes":1882,"kill":1883,"demonstrates":1884,"co":1885,"locate":1886,"training":1887,"actors":1888,"reinforcement":1889,"human":1890,"rlhf":1891,"workloads":1892,"serves":1893,"framework":1894,"placement":1895,"workers":1896,"bundles":1897,"enabling":1898,"two":1899,"script":1900,"shows":1901,"variables":1902,"vllm_ray_per_worker_gpus":1903,"vllm_ray_bundle_indices":1904,"desired":1905,"devices":1906,"exchange":1907,"tensors":1908,"means":1909,"inter":1910,"ipc":1911,"sidesteps":1912,"nccl":1913,"limitations":1914,"occur":1915,"share":1916,"assumes":1917,"cluster":1918,"four":1919,"clusters":1920,"expects":1921,"exclusive":1922,"profiling":1923,"residual":1924,"activity":1925,"interferes":1926,"causes":1927,"unexpected":1928,"io":1929,"placement_group":1930,"scheduling_strategies":1931,"placementgroupschedulingstrategy":1932,"myllm":1933,"constructor":1934,"sets":1935,"encode":1936,"bundle":1937,"indices":1938,"positional":1939,"forwarded":1940,"bundle_indices":1941,"kwargs":1942,"keyword":1943,"prevent":1944,"manipulating":1945,"top":1946,"pop":1947,"fit":1948,"map":1949,"creating":1950,"raytrainingactor":1951,"actor":1952,"hosts":1953,"facebook":1954,"opt":1955,"125m":1956,"onto":1957,"expose":1958,"handles":1959,"colocated":1960,"automodelforcausallm":1961,"from_pretrained":1962,"parameters":1963,"named_parameters":1964,"zero_":1965,"synchronize":1966,"get_device_uuid":1967,"platforms":1968,"current_platform":1969,"device_uuid":1970,"report_device_id":1971,"get_weight_ipc_handles":1972,"reductions":1973,"reduce_tensor":1974,"hold":1975,"subset":1976,"weights":1977,"gather":1978,"purposes":1979,"owns":1980,"detach":1981,"manages":1982,"init":1983,"pg":1984,"ready":1985,"bundle_specs":1986,"training_actors":1987,"training_actor_device_ids":1988,"inference_engines":1989,"inference_engine_device_ids":1990,"bundle_index":1991,"training_actor":1992,"num_cpus":1993,"num_gpus":1994,"scheduling_strategy":1995,"placement_group_capture_child_tasks":1996,"placement_group_bundle_index":1997,"device_id":1998,"syntax":1999,"instead":2000,"decorator":2001,"customized":2002,"worker_extension_cls":2003,"rlhf_utils":2004,"colocateworkerextension":2005,"distributed_executor_backend":2006,"call":2007,"method":2008,"point":2009,"blocks":2010,"until":2011,"finishes":2012,"collective_rpc":2013,"tuple":2014,"last":2015,"ipc_handles":2016,"update_weights_from_ipc_handles":2017,"check_weights_changed":2018,"generation":2019,"comparing":2020,"still":2021,"vllm_use_v1":2022,"mlpspeculator":2023,"gc":2024,"time_generation":2025,"warmup":2026,"sum":2027,"token_ids":2028,"template":2029,"instruction":2030,"describes":2031,"task":2032,"appropriately":2033,"13b":2034,"hf":2035,"speculation":2036,"del":2037,"collect":2038,"speculative_config":2039,"accelerator":2040,"profiler":2041,"cmd":2042,"vllm_torch_profiler_dir":2043,"vllm_profile":2044,"start_profile":2045,"stop_profile":2046,"add":2047,"buffer":2048,"wait":2049,"background":2050,"finish":2051,"writing":2052,"running":2053,"correct":2054,"namedtuple":2055,"huggingface_hub":2056,"snapshot_download":2057,"autotokenizer":2058,"audioasset":2059,"lorarequest":2060,"audio_assets":2061,"mary_had_lamb":2062,"winning_call":2063,"question_per_audio_count":2064,"recited":2065,"sport":2066,"nursery":2067,"rhyme":2068,"referenced":2069,"modelrequestdata":2070,"prompt_token_ids":2071,"multi_modal_data":2072,"stop_token_ids":2073,"lora_requests":2074,"oom":2075,"unless":2076,"settings":2077,"tested":2078,"l4":2079,"voxtral":2080,"run_voxtral":2081,"question":2082,"audio_count":2083,"protocol":2084,"instruct":2085,"messages":2086,"audiochunk":2087,"rawaudio":2088,"textchunk":2089,"usermessage":2090,"chatcompletionrequest":2091,"tokenizers":2092,"mistraltokenizer":2093,"model_name":2094,"mistralai":2095,"mini":2096,"2507":2097,"tokenizer":2098,"from_hf_hub":2099,"8192":2100,"limit_mm_per_prompt":2101,"config_format":2102,"tokenizer_mode":2103,"enable_chunked_prefill":2104,"text_chunk":2105,"audios":2106,"from_file":2107,"get_local_path":2108,"strict":2109,"audio_chunks":2110,"input_audio":2111,"from_audio":2112,"encode_chat_completion":2113,"prompt_ids":2114,"audios_and_sr":2115,"au":2116,"audio_array":2117,"sampling_rate":2118,"gemma3n":2119,"run_gemma3n":2120,"gemma":2121,"3n":2122,"e2b":2123,"max_num_batched_tokens":2124,"start_of_turn":2125,"audio_soft_token":2126,"end_of_turn":2127,"granite":2128,"speech":2129,"run_granite_speech":2130,"somehat":2131,"optimal":2132,"recommended":2133,"readme":2134,"suggested":2135,"8b":2136,"max_lora_rank":2137,"dir":2138,"enabled":2139,"whenever":2140,"inputs":2141,"speech_lora_path":2142,"audio_placeholder":2143,"start_of_role":2144,"end_of_role":2145,"knowledge":2146,"cutoff":2147,"ntoday":2148,"december":2149,"nyou":2150,"helpful":2151,"assistant":2152,"end_of_text":2153,"minicpm":2154,"run_minicpmo":2155,"openbmb":2156,"2_6":2157,"4096":2158,"stop_tokens":2159,"im_end":2160,"endoftext":2161,"convert_tokens_to_ids":2162,"audio_chat_template":2163,"message":2164,"im_start":2165,"role":2166,"endfor":2167,"add_generation_prompt":2168,"spk_bos":2169,"spk":2170,"spk_eos":2171,"tts_bos":2172,"endif":2173,"apply_chat_template":2174,"tokenize":2175,"chat_template":2176,"phi":2177,"run_phi4mm":2178,"image":2179,"microsoft":2180,"vision":2181,"manually":2182,"specify":2183,"placeholders":2184,"audio_":2185,"12800":2186,"320":2187,"run_phi4_multimodal":2188,"revision":2189,"refs":2190,"70":2191,"qwen2":2192,"run_qwen2_audio":2193,"qwen":2194,"7b":2195,"audio_in_prompt":2196,"idx":2197,"audio_bos":2198,"audio_eos":2199,"omni":2200,"run_qwen2_5_omni":2201,"default_system":2202,"virtual":2203,"capable":2204,"perceiving":2205,"auditory":2206,"visual":2207,"generating":2208,"ultravox":2209,"run_ultravox":2210,"fixie":2211,"v0_5":2212,"3_2":2213,"whisper":2214,"run_whisper":2215,"input":2216,"per":2217,"turbo":2218,"startoftranscript":2219,"448":2220,"model_example_map":2221,"granite_speech":2222,"minicpmo":2223,"phi4_mm":2224,"phi4_multimodal":2225,"qwen2_audio":2226,"qwen2_5_omni":2227,"demo":2228,"choices":2229,"keys":2230,"model_type":2231,"seed":2232,"initializing":2233,"num_audios":2234,"req_data":2235,"modalities":2236,"default_limits":2237,"identical":2238,"batch":2239,"mm_data":2240,"asset":2241,"audio_and_sample_rate":2242,"num_prompts":2243,"applicable":2244,"lora_request":2245,"add_dataset_parser":2246,"get_samples":2247,"metrics":2248,"reader":2249,"counter":2250,"vector":2251,"importerror":2252,"image_urls":2253,"upload":2254,"wikimedia":2255,"wikipedia":2256,"commons":2257,"da":2258,"2015_kaczka_krzy":2259,"c5":2260,"bcowka_w_wodzie_":2261,"28samiec":2262,"29":2263,"jpg":2264,"77":2265,"002_the_lion_king_snyggve_in_the_serengeti_national_park_photo_by_giles_laurent":2266,"26":2267,"ultramarine_flycatcher_":2268,"28ficedula_superciliaris":2269,"29_naggar":2270,"2c_himachal_pradesh":2271,"2c_2013_":2272,"28cropped":2273,"thumb":2274,"anim1754_":2275,"_flickr_":2276,"_noaa_photo_library_":2277,"281":2278,"2560px":2279,"d4":2280,"starfish":2281,"2c_caswell_bay_":2282,"_geograph":2283,"uk_":2284,"_409413":2285,"69":2286,"grapevinesnail_01":2287,"0b":2288,"texas_invasive_musk_thistle_1":2289,"1920px":2290,"7a":2291,"huskiesatrest":2292,"2880px":2293,"68":2294,"orange_tabby_cat_sitting_on_fallen_leaves":2295,"hisashi":2296,"01a":2297,"george_the_amazing_guinea_pig":2298,"1f":2299,"oryctolagus_cuniculus_rcdo":2300,"98":2301,"horse":2302,"pony":2303,"get_custom_mm_prompts":2304,"image_url":2305,"eagle":2306,"ngram":2307,"eagle3":2308,"mtp":2309,"lookup":2310,"temp":2311,"256":2312,"custom":2313,"mm":2314,"endpoint_type":2315,"model_dir":2316,"custom_mm_prompts":2317,"custom_skip_chat_template":2318,"add_special_tokens":2319,"bos":2320,"twice":2321,"templates":2322,"eagle_dir":2323,"yuhuili":2324,"num_speculative_tokens":2325,"num_spec_tokens":2326,"prompt_lookup_max":2327,"prompt_lookup_min":2328,"disable_log_stats":2329,"16384":2330,"disable_chunked_mm_input":2331,"output_len":2332,"print_output":2333,"get_metrics":2334,"assertionerror":2335,"total_num_output_tokens":2336,"num_drafts":2337,"num_draft_tokens":2338,"num_accepted_tokens":2339,"acceptance_counts":2340,"metric":2341,"spec_decode_num_drafts":2342,"isinstance":2343,"spec_decode_num_draft_tokens":2344,"spec_decode_num_accepted_tokens":2345,"spec_decode_num_accepted_tokens_per_pos":2346,"pos":2347,"values":2348,"acceptance_length":2349,"mean":2350,"acceptance":2351,"2f":2352,"position":2353,"acceptance_rate":2354,"disaggregated":2355,"prefilling":2356,"launch":2357,"transfer":2358,"kv":2359,"cache":2360,"kvtransferconfig":2361,"run_prefill":2362,"prefill_done":2363,"receives":2364,"while":2365,"three":2366,"receive":2367,"hi":2368,"tell":2369,"me":2370,"very":2371,"long":2372,"story":2373,"pyncclconnector":2374,"transmit":2375,"caches":2376,"kv_producer":2377,"ktc":2378,"kv_connector":2379,"kv_role":2380,"kv_rank":2381,"kv_parallel_size":2382,"a6000":2383,"40gb":2384,"adjust":2385,"kv_transfer_config":2386,"2000":2387,"finished":2388,"prematurely":2389,"causing":2390,"incomplete":2391,"keyboardinterrupt":2392,"stopped":2393,"run_decode":2394,"kv_consumer":2395,"producer":2396,"pipe":2397,"waiting":2398,"transferred":2399,"prefill_process":2400,"decode_process":2401,"terminate":2402,"namespace":2403,"pil":2404,"autoprocessor":2405,"fetch_image":2406,"image_data":2407,"load_aria":2408,"rhymes":2409,"aria":2410,"slow":2411,"fim_prefix":2412,"fim_suffix":2413,"93532":2414,"93653":2415,"944":2416,"93421":2417,"1019":2418,"93519":2419,"load_aya_vision":2420,"cohereforai":2421,"aya":2422,"processor":2423,"load_command_a_vision":2424,"coherelabs":2425,"122b":2426,"32768":2427,"load_deepseek_vl2":2428,"vl2":2429,"tiny":2430,"hf_overrides":2431,"architectures":2432,"deepseekvlv2forcausallm":2433,"image_":2434,"load_gemma3":2435,"4b":2436,"load_h2ovl":2437,"h2oai":2438,"h2ovl":2439,"mississippi":2440,"800m":2441,"mm_processor_kwargs":2442,"max_dynamic_patch":2443,"eos_token_id":2444,"load_hyperclovax_seed_vision":2445,"naver":2446,"hyperclovax":2447,"_image_url":2448,"ocr":2449,"lens_keywords":2450,"lens_local_keywords":2451,"load_idefics3":2452,"huggingfacem4":2453,"idefics3":2454,"confirmed":2455,"l40":2456,"longest_edge":2457,"optimizations":2458,"364":2459,"begin_of_text":2460,"end_of_utterance":2461,"nassistant":2462,"load_interns1":2463,"internlm":2464,"intern":2465,"s1":2466,"img_context":2467,"load_internvl":2468,"opengvlab":2469,"internvl2":2470,"2b":2471,"internvl":2472,"variants":2473,"card":2474,"words":2475,"conversation":2476,"load_llama4":2477,"scout":2478,"17b":2479,"16e":2480,"131072":2481,"load_llava":2482,"caution":2483,"original":2484,"wasn":2485,"really":2486,"trained":2487,"poor":2488,"load_llava_next":2489,"load_llava_onevision":2490,"onevision":2491,"ov":2492,"load_keye_vl":2493,"kwai":2494,"keye":2495,"vl":2496,"preview":2497,"load_kimi_vl":2498,"moonshotai":2499,"kimi":2500,"a3b":2501,"load_mistral3":2502,"small":2503,"24b":2504,"2503":2505,"ignore_patterns":2506,"consolidated":2507,"inst":2508,"load_mllama":2509,"11b":2510,"img_prompt":2511,"given":2512,"load_nvlm_d":2513,"nvlm":2514,"72b":2515,"ovis":2516,"load_ovis":2517,"aidc":2518,"ovis2":2519,"half":2520,"load_pixtral_hf":2521,"pixtral":2522,"12b":2523,"load_phi3v":2524,"num_crops":2525,"kwarg":2526,"frame":2527,"scenarios":2528,"speaking":2529,"larger":2530,"preprocessing":2531,"references":2532,"formula":2533,"transform":2534,"found":2535,"loading":2536,"locally":2537,"processing_phi3_v":2538,"l194":2539,"load_phi4mm":2540,"images":2541,"vision_lora_path":2542,"passed":2543,"dynamic_hd":2544,"load_phi4_multimodal":2545,"load_qwen_vl_chat":2546,"qwenvlforconditionalgeneration":2547,"attribute":2548,"chatml":2549,"qwen_generation_utils":2550,"l265":2551,"copied":2552,"chat_templating":2553,"load_qwen2_vl":2554,"qwen_vl_utils":2555,"smart_resize":2556,"modulenotfounderror":2557,"resized":2558,"functionality":2559,"post_process_image":2560,"height":2561,"resized_height":2562,"resized_width":2563,"max_pixels":2564,"28":2565,"resize":2566,"load_qwen2_5_vl":2567,"load_smolvlm":2568,"huggingfacetb":2569,"smolvlm2":2570,"max_image_size":2571,"384":2572,"load_step3":2573,"stepfun":2574,"step3":2575,"verified":2576,"8xh100":2577,"85":2578,"reasoning_parser":2579,"begin":2580,"sentence":2581,"bot":2582,"im_patch":2583,"eot":2584,"think":2585,"load_tarsier":2586,"tarsier":2587,"load_tarsier2":2588,"tarsier2":2589,"recap":2590,"tarsier2forconditionalgeneration":2591,"vision_start":2592,"image_pad":2593,"vision_end":2594,"aya_vision":2595,"command_a_vision":2596,"deepseek_vl_v2":2597,"gemma3":2598,"h2ovl_chat":2599,"hyperclovax_seed_vision":2600,"interns1":2601,"internvl_chat":2602,"keye_vl":2603,"kimi_vl":2604,"next":2605,"mistral3":2606,"mllama":2607,"nvlm_d":2608,"phi3_v":2609,"pixtral_hf":2610,"qwen_vl_chat":2611,"qwen2_vl":2612,"qwen2_5_vl":2613,"smolvlm":2614,"run_generate":2615,"run_chat":2616,"num_images":2617,"invalid":2618,"random":2619,"calling":2620,"want":2621,"client":2622,"http":2623,"8000":2624,"completions":2625,"header":2626,"application":2627,"authorization":2628,"bearer":2629,"describe":2630,"detail":2631,"amazonaws":2632,"cms":2633,"ipressroom":2634,"338":2635,"201808":2636,"5b894ee1a138352221103195_a680":2637,"7ejogging":2638,"a680":2639,"edit_hero":2640,"one":2641,"answer":2642,"french":2643,"wolframcloud":2644,"obj":2645,"resourcesystem":2646,"a0e":2647,"a0ee3983":2648,"46c6":2649,"4c92":2650,"b85d":2651,"059044639928":2652,"6af8cfb971db031b":2653,"simple":2654,"switch":2655,"nemo":2656,"2407":2657,"ability":2658,"generate_random_id":2659,"characters":2660,"ascii_letters":2661,"digits":2662,"random_id":2663,"choice":2664,"simulate":2665,"called":2666,"get_current_weather":2667,"city":2668,"unit":2669,"weather":2670,"degrees":2671,"partly":2672,"cloudly":2673,"highs":2674,"90":2675,"tool_functions":2676,"tools":2677,"properties":2678,"francisco":2679,"letter":2680,"abbreviation":2681,"ca":2682,"california":2683,"enum":2684,"celsius":2685,"fahrenheit":2686,"temperate":2687,"dallas":2688,"let":2689,"simulating":2690,"above":2691,"tool_calls":2692,"tool_answers":2693,"tool_call_id":2694,"yields":2695,"tx":2696,"separates":2697,"distinct":2698,"manage":2699,"occupies":2700,"whereas":2701,"performs":2702,"steps":2703,"across":2704,"broadcast":2705,"collective":2706,"rpc":2707,"simply":2708,"production":2709,"implementation":2710,"replicas":2711,"openrlhf":2712,"stateless_init_process_group":2713,"get_ip":2714,"workload":2715,"train_model":2716,"initialize":2717,"placed":2718,"reserves":2719,"pg_inference":2720,"scheduling_inference":2721,"flag":2722,"reduces":2723,"up":2724,"latency":2725,"workerextension":2726,"master_address":2727,"handle":2728,"init_weight_update_group":2729,"model_update_group":2730,"zeroing":2731,"real":2732,"gradient":2733,"rl":2734,"objective":2735,"ppo":2736,"reward":2737,"dtype_name":2738,"update_weight":2739,"shape":2740,"stream":2741,"current_stream":2742,"expected":2743,"nonsense":2744,"outputs_updated":2745,"llmengine":2746,"create_test_prompts":2747,"robot":2748,"injure":2749,"logprobs":2750,"prompt_logprobs":2751,"top_k":2752,"presence_penalty":2753,"meaning":2754,"life":2755,"frequency_penalty":2756,"process_requests":2757,"test_prompts":2758,"continuously":2759,"request_id":2760,"has_unfinished_requests":2761,"add_request":2762,"request_outputs":2763,"request_output":2764,"initialize_engine":2765,"from_engine_args":2766,"runs":2767,"datetime":2768,"union":2769,"albumentations":2770,"numpy":2771,"np":2772,"rasterio":2773,"regex":2774,"einops":2775,"rearrange":2776,"terratorch":2777,"datamodules":2778,"sen1floods11nongeodatamodule":2779,"set_default_dtype":2780,"float16":2781,"no_data":2782,"9999":2783,"no_data_float":2784,"0001":2785,"offset":2786,"percentile":2787,"datamodule_config":2788,"bands":2789,"blue":2790,"green":2791,"red":2792,"nir_narrow":2793,"swir_1":2794,"swir_2":2795,"batch_size":2796,"constant_scale":2797,"data_root":2798,"dccstor":2799,"geofm":2800,"finetuning":2801,"sen1floods11":2802,"drop_last":2803,"no_data_replace":2804,"no_label_replace":2805,"num_workers":2806,"test_transform":2807,"always_apply":2808,"interpolation":2809,"totensorv2":2810,"transpose_mask":2811,"prithvimae":2812,"skip_tokenizer_init":2813,"input_data":2814,"location_coords":2815,"structure":2816,"float32":2817,"pixel_values":2818,"use_tqdm":2819,"generate_datamodule":2820,"datamodule":2821,"process_channel_group":2822,"orig_img":2823,"reference":2824,"rgb":2825,"num_channels":2826,"valid_mask":2827,"ones_like":2828,"rescale":2829,"enhancing":2830,"contrast":2831,"max_value":2832,"3000":2833,"min_value":2834,"clamp":2835,"zeros":2836,"read_geotiff":2837,"file_path":2838,"ndarray":2839,"coords":2840,"lnglat":2841,"save_geotiff":2842,"output_path":2843,"band":2844,"geotiff":2845,"dest":2846,"_convert_np_uint8":2847,"float_image":2848,"255":2849,"astype":2850,"uint8":2851,"load_example":2852,"file_paths":2853,"std":2854,"paths":2855,"containing":2856,"array":2857,"imgs":2858,"metas":2859,"temporal_coords":2860,"rescaling":2861,"don":2862,"normalize":2863,"nodata":2864,"moveaxis":2865,"julian_day":2866,"strptime":2867,"timetuple":2868,"tm_yday":2869,"timestamp":2870,"axis":2871,"num_frames":2872,"expand_dims":2873,"di":2874,"run_model":2875,"img_size":2876,"lightning_model":2877,"reflect":2878,"pad":2879,"original_h":2880,"original_w":2881,"pad_h":2882,"pad_w":2883,"sliding":2884,"window":2885,"windows":2886,"unfold":2887,"h1":2888,"w1":2889,"batches":2890,"num_batches":2891,"tensor_split":2892,"dim":2893,"unsqueeze":2894,"prithvi":2895,"eo":2896,"300m":2897,"tl":2898,"pred_imgs":2899,"standardization":2900,"squeeze":2901,"transpose":2902,"no_grad":2903,"pred":2904,"y_hat":2905,"argmax":2906,"nn":2907,"interpolate":2908,"nearest":2909,"concat":2910,"patches":2911,"padded":2912,"area":2913,"data_file":2914,"output_dir":2915,"rgb_outputs":2916,"input_indices":2917,"model_obj":2918,"meta_data":2919,"10000":2920,"convert":2921,"bgr":2922,"compress":2923,"lzw":2924,"pred_file":2925,"pred_":2926,"tiff":2927,"rgb_orig":2928,"nan":2929,"img_pred":2930,"isnan":2931,"img_pred_file":2932,"rgb_pred_":2933,"name_suffix":2934,"rgb_file":2935,"original_rgb_":2936,"mae":2937,"add_help":2938,"india_900498_s2hand":2939,"tif":2940,"christian":2941,"pinto":2942,"nargs":2943,"six":2944,"selected":2945,"selects":2946,"s2l1c":2947,"vars":2948,"instantiating":2949,"logits":2950,"basic":2951,"implementing":2952,"dummylogitsprocessor":2953,"test_utils":2954,"dummy":2955,"employed":2956,"target_token":2957,"extra_args":2958,"mask":2959,"constructed":2960,"specifying":2961,"expect":2962,"decoded":2963,"yielding":2964,"shown":2965,"racist":2966,"he":2967,"nhe":2968,"hands":2969,"nthe":2970,"vllmconfig":2971,"logits_processor":2972,"batchupdate":2973,"logitsprocessor":2974,"movedirectionality":2975,"hypothetical":2976,"fake":2977,"logit":2978,"vllm_config":2979,"is_pin_memory":2980,"req_info":2981,"is_argmax_invariant":2982,"never":2983,"impacts":2984,"greedy":2985,"update_state":2986,"batch_update":2987,"moved":2988,"unidirectional":2989,"move":2990,"swap":2991,"adx":2992,"bdx":2993,"direct":2994,"a_val":2995,"b_val":2996,"modification":2997,"rows_list":2998,"cols":2999,"rows":3000,"values_to_keep":3001,"clone":3002,"inf":3003,"utilize":3004,"logitproc":3005,"sampling_params_list":3006,"67":3007,"logits_processors":3008,"60":3009,"credentials":3010,"llama2":3011,"lora_path":3012,"define":3013,"adapters":3014,"max_loras":3015,"expectation":3016,"adapter":3017,"ran":3018,"sql":3019,"query":3020,"table":3021,"schema":3022,"table_name_74":3023,"icao":3024,"varchar":3025,"airport":3026,"lilongwe":3027,"international":3028,"32003":3029,"lora2":3030,"controls":3031,"loras":3032,"numbers":3033,"higher":3034,"slot":3035,"preallocated":3036,"know":3037,"possible":3038,"max_cpu_loras":3039,"repo_id":3040,"yard1":3041,"guided":3042,"structured":3043,"techniques":3044,"grammar":3045,"formatted":3046,"pydantic":3047,"basemodel":3048,"guideddecodingparams":3049,"options":3050,"guided_decoding_params_choice":3051,"negative":3052,"sampling_params_choice":3053,"guided_decoding":3054,"prompt_choice":3055,"classify":3056,"sentiment":3057,"wonderful":3058,"guided_decoding_params_regex":3059,"sampling_params_regex":3060,"prompt_regex":3061,"alan":3062,"turing":3063,"works":3064,"enigma":3065,"cartype":3066,"sedan":3067,"suv":3068,"truck":3069,"coupe":3070,"cardescription":3071,"brand":3072,"car_type":3073,"json_schema":3074,"model_json_schema":3075,"guided_decoding_params_json":3076,"sampling_params_json":3077,"prompt_json":3078,"iconic":3079,"car":3080,"simplified_sql_grammar":3081,"select_statement":3082,"column":3083,"condition":3084,"col_1":3085,"col_2":3086,"table_1":3087,"table_2":3088,"guided_decoding_params_grammar":3089,"sampling_params_grammar":3090,"prompt_grammar":3091,"username":3092,"format_output":3093,"generate_output":3094,"choice_output":3095,"regex_output":3096,"json_output":3097,"grammar_output":3098,"am":3099,"config_buckets":3100,"initialize_llm":3101,"openlm":3102,"open_llama_7b":3103,"open_llama_3b":3104,"32":3105,"neuronx_distributed_inference":3106,"add_instruct":3107,